[{"title":"Brave Browser","html":"<p></p><p>El terreno de la navegación por internet está dominado por los navegadores Chrome, Firefox, Opera, Safari, Edge los cuales son más populares y usados en el mundo, sin embargo hay opciones que están a la par, o incluso superar a los anteriormente mencionados con ciertas mejoras y ese es el caso de Brave.</p><p>Prácticamente, Brave, es un navegador con características muy interesantes e útiles. Esté Browser está creado bajo la plataforma Chromium, el cual es un proyecto abierto por Google y en el cual se base su navegador, y esto es una gran ventaja debido a que permite instalar todas las extensiones, por lo cual no te tienes que preocupar por aquellas extensiones que tengas en tu Chrome.</p><p>Brave es de uso gratuito y tiene varios elementos que le permite posicionarse con el resto de la competencia.</p><p><strong>Seguridad</strong></p><p>Brave resalta por poseer un gran abanico de opciones de seguridad que muestra todo lo que se encuentra bloqueado o se puede hacer en la página abierta. Además permite controlar configuraciones de manejo de protección de puntos de seguimiento, conexiones HTTPS, bloqueo de comandos, reconocimiento de dispositivos y cookies.</p><p><strong>Velocidad de carga</strong></p><p>Brave ofrece un peso de 1.24MB, lo que hace que su velocidad de carga sea superior a la de otros navegadores como Chrome,  y esto se debe a que no permite anuncio y rastreadores de estos, lo que ayuda a que los sitios web carguen hasta ocho veces más rápido.</p><p><strong>Apariencia y funcionalidad</strong></p><p>Su estética es similar a Browser de Google, con un toque único y gustoso. Además su versatilidad puede ser la funcionalidad más fuerte. El equipo de desarrolladores mantienen mejorando lo y aplicando cambios como el popular modo oscuro, brindando una ventaja competitiva.</p><p>Como te he contado, si estás buscando una alternativa parecida a Chrome, Brave es una de las mejores propuestas del mercado. Otro plus es que podemos instalarlo tanto en PC como en móvil.</p>","slug":"brave","createdAt":"2020-10-17T05:07:45.000+00:00","id":"5f8a7c210b0511001e2747b7","desc":"Brave Browser y un pequeño vistazo a sus bondades.","tag":"tech","image":null},{"title":"Aprende a instalar Kali linux en Docker","html":"<p></p><p>¿ Imaginas poder usar Kali linux sin necesidad de instalar una maquina virtual?Cuando se habla de esté sistema operativo se piensa que sólo se puede utilizar en maquinas virtuales, USB, o arranque dual, pero la verdad existe otra solución y es usar docker, pues está tecnología nos provee una forma fácil de instalar y emplear kali.</p><p>En la página de Docker Hubs ofrece el contenedor oficial de <a href=\"https://hub.docker.com/r/kalilinux/kali-rolling\">Kali linux</a> , donde los requisitos son tener Docker instalado y tener conocimientos sobre él mismo. </p><p>Hoy pienso compartir con ustedes los pasos para instalar Kali linux en Docker:</p><p></p><p><strong>Paso 1</strong></p><p>Descargar la imagen oficial desde docker hub con el siguiente comando que debe ser ingresado en la terminal o consola de nuestro equipo:</p><!--kg-card-begin: html-->docker pull kalilinux/kali-rolling<!--kg-card-end: html--><p></p><p><strong>Paso 2</strong></p><p>Luego pasamos a crear el contenedor con kali usando las siguientes opciones.</p><p><strong>--name</strong> : esté flag nos permite dar nombre al contenedor</p><p><strong>--net=\"host\"</strong> : esté flag permite usar la interfaz del host brindando el poder de usar la interfaz inalámbrica en modo  monitor desde el contenedor, igualmente toma en cuenta los puertos que serán enlazados directamente con los del host y la dirección IP del host la cual será la misma para el contenedor. Nota: esto solo funciona en Docker para linux.</p><p><strong>--privileged</strong> : esté flag  junto con --net permiten colocar la interfaz de red en modo monitor y usar hardware del host como por ejemplo el bluetooth.</p><p><strong>-e DISPLAY=$DISPLAY -v /tmp/.X11-unix:/tmp/.X11-unix</strong> : estos dos flags permiten ejecutar las aplicaciones que requieran de un servidor gráfico usando el host, por ejemplo el firefox instalado en el contenedor pero antes hay que otorgar los permisos necesarios desde el host con el comando <strong>xhost +</strong></p><p><strong>-it</strong> : esté flag permite al contenedor ejecutar el modo interactivo en la terminal actual.</p><p>El comando completo para la creación sería la siguiente</p><!--kg-card-begin: html-->docker run --name kali_linux --net=\"host\" --privileged -e DISPLAY=$DISPLAY -it -v /tmp/.X11-unix:/tmp/.X11-unix kalilinux/kali-rolling /bin/bash<!--kg-card-end: html--><p></p><p><strong>Paso 3</strong></p><p>Hay que tener en cuenta que kali linux solo ofrece una imagen que está incompleta por lo que es necesario instalar el resto de paquetes usando el gestor de paquetes apt.</p><p>Para buscar los paquetes que se necesitan debemos realizarlo de la siguiente manera:</p><!--kg-card-begin: html-->apt-get update && apt-cache search kali-linux<!--kg-card-end: html--><p></p><p>La referencia completa así como el peso de descarga de los paquetes se encuentra disponible en el sitio de <a href=\"https://www.kali.org/news/kali-linux-metapackages/\">kali linux</a>, ejemplo de instalación de Metapackages  en kali.</p><!--kg-card-begin: html-->apt-get install kali-tools-top10<!--kg-card-end: html--><p></p><p>Para mayor información visitar el siguiente enlace: <a href=\"https://www.kali.org/docs/general-use/metapackages/\">link</a></p><p><strong>Paso 4</strong></p><p>Esté paso es opcional, es solo en caso de necesitar utilizar comando de red como el ifconfig y ping que lamentablemente no vienen instalado y para realizar está tarea se hacen de la siguiente manera:</p><!--kg-card-begin: html-->apt-get install net-tools\n&& apt-get install iputils-ping<!--kg-card-end: html--><p></p><p>Para finalizar Docker es una buena alternativa para no depender de una memoria USB o el arranque dual para usar kali linux, además esta forma de instalación permite usar las herramientas como si formarán parte del host donde se encuentra el contenedor, de forma similar a como funciona las aplicaciones con Snap.</p>","slug":"kali-linux-y-docker","createdAt":"2020-10-17T03:42:00.000+00:00","id":"5f8a68080b0511001e274681","desc":"Instalación de Kali linux en Docker de manera sencilla","tag":"tech","image":null},{"title":"Extinction","html":"<p><strong>Prólogo</strong></p><p>Existen días que extrañas cómo era la vida antes de que todo se acabará. El mundo era feliz, próspero, pero de un día para otro cambia y de una manera radical.  Nadie se imaginaba lo que iba a pasar, aunque si recibimos avisos de los científicos. Que ciegos fuimos no hicimos caso omiso y venos aquí.</p><p>Para empezar el mundo estaba bien, viviamos bien de nuestra tecnología, celulares, vida moderna, con influencers, compras online, redes sociales, claro existían problemas, depresión, corrupcion y otros más.</p><p>Sin embargo la vida se fue acabando cuando comenzó a escasear a alimentos y animales, los cuáles los estábamos MATANDO. Entramos en desesperación, todos querían sobrevivir, he hicimos cosas terribles.  Buscábamos alimentos a cualquier costo que hizo que todo se acabará. Si alguien encontraba plantas o animales, trataba de ocultarlos, pero era muy difícil vivir asì, la gente siempre encontraba alguna forma de descrubrilos y se luchaba con el que se interpusiera, sobrevivir era la única ley existente.</p><p>Primero empezaron aparecer disturbios, daños y asaltos, todo lo que se encontraba en supermercados, casas, era primordial y cada uno veía por su propia supervivencia. También, se vieron casos en que la gente robaba  bancos y cosas materiales, es absurdo, cómo si eso ayudará a mantener tu sobrevivencia, cuando la sociedad se desmorona, no importa mucho el dinero que tengas, aunque si te surtias de cosas importantes cómo medicamentos, armas y herramientas, eso sí garantizaba sobrevivir en estos tiempos.</p><p>Luego, aparecieron grupos y cazadores que buscaban y recogian  lo poco que quedaba, pero ellos eran especiales, no solo iban en busca de alimentos y suministros, si no también, detras de personas, para ¡<strong><em>alimentarse!</em></strong> de lo que hallaban. </p><p>Se dice que todo inicio con un granjero que tenía escondido sus animales; un perro y un gato. Esté sujeto les tenía tanto cariño que no los mataba, sobrevivió comiendo de un pequeño vuerto que tenía, además logro conseguir bastante víveres para sus mascotas y él, todo obtenido de los supermercados y granjas cercanas. </p><p>Pero un día un grupo de merodeadores entró su morada, en busca de algunos suministros y alimentos, encontrando sus animales, esté grupo de personas estaban muy desesperadas por alimentarse, por lo cuál decidieron asesinar aquellos animales, y en el preciso momento que se encontraban comiendo, entra el granjero, observando como se deleitaban con sus amigos. Fue muy cruel lo que hicieron, luego, ataron al hombre y comenzaron a robarse todo lo que tenia el hombre, pero no solo eso, destruyeron su vuerto y su hogar, sin embargo dejaron vivo al pobre hombre, GRAVE  ERROR.</p><p>El hombre estaba tan devastado y vacio que ya no le importaba nada y decidió no dejar las cosas así. Fue por esas personas que le habian causado tanto daño, buscó demasiado hasta que finalmente los encontró, en un pequeño pueblo, dentro de un bar o lo que fue uno. Está persona comienza a capturarlos  y encerrarlos en la comisaría cercana.</p><p>Después, el granjero dispone a infligir el mayor dolor y aterrorizarlos a cada una de las personas para hacerles pagar la enorme deuda que tenian con él. Esté hombre los torturo  hasta cansarse, no se sabe bien pero al final decidió comérselos, algo cambió en el granjero ese día, pues el sabór erá tan bueno, la carne tan jugosa que le gustó comer, que comenzó a cazar.</p><p>Se cuenta que desde ese momento empezaron a aparecer grupos cámbiales, aunque hay otras personas dicen que fue mucho antes. Sea como sea se crearon grupos donde cada integrante buscaba a los otros y los cazaban para seguir sobreviviendo.</p>","slug":"extinction","createdAt":"2020-09-14T14:36:46.000+00:00","id":"5f5f7ffe853246001e69c504","desc":"Una historia web sobre un mundo post apocalíptico, contando cómo decayó el mundo después de un suceso trágico y cómo es la vida luego de suceder.","tag":"history","image":null},{"title":"Secretos detrás de la Red de Internet","html":"<p></p><p>Internet ha cambiado la forma en la que nos comunicamos, tanto a nivel economico, cómo Politico y esto es gracias a las redes de internet. Hoy en día podemos comunicarnos sin importar en dónde nos encontramos y esta es una de las grandes ventajas que tiene está tecnología. Pero cómo funciona, que hay detras de ella. </p><p>Lo primero antes de conocer qué es Internet debemos definir que es una red, sencillamente el objetivo de una red es transportar un elemento de un lugar a otro.</p><p>Siempre tenemos un punto de partida y un punto de llegada. Una red informática es un conjunto de equipos conectados entre sí por medio de dispositivos físicos o inalámbricos que envían y reciben impulsos eléctricos, ondas electromagnéticas, o cualquier otro medio para el transporte de datos.</p><p>La red es tiene tres puntos o características principales:</p><ul><li>Objetivo transportar algo de un lugar a otro</li><li>Punto de partida y de llegada</li><li>Puntos conectados por un medio.</li></ul><p><strong>¿Qué es internet?</strong></p><p>Basicamente el internet es una red de redes interconectadas mundialmente. Qué es distribuida por un ISP (Internet Service Provider-Proveedor de servicios de Internet): Es la empresa que te brinda la conexión a Internet y te permite navegar por la red.</p><p>Ahora bien teniendo, esto claro hay otros conceptos que abarcan la comunicación en redes LAN, WAN, MAN y Topologías de Red.</p><ul><li><strong>La red LAN (Local Area Network-Red de area local):</strong> es una red pequeña como las que tenemos en la casa, o en una oficina pequeña.  Es una red que conecta ordenadores o dispositivos en un área relativamente pequeña con el fin de compartir recursos, datos o apps.</li><li><strong>Las redes WAN (Wide Area Network-Red de area amplia):</strong> son redes que interconectan países o ciudades. Este tipo de red generalmente sirve para conectar dispositivos que se encuentran separados por un área geográfica extensa, es decir, si las redes LAN conectan computadores o dispositivos en un area “pequeña”, las redes WAN conectaran “sucursales” con sedes centrales</li><li><strong>Las redes MAN (Metropolitan Area Network-Red de área metropoltana):</strong> conecta como un barrio, esto quiere decir que es mucho más pequeña. Es una infraestructura de red que abarca un area mayor a una LAN pero menor que una WAN.</li></ul><p><strong>Intranet y Extranet</strong></p><p>Intranet</p><p>Son aquellas redes internas que en las que el acceso a la información esta estrictamente limitada a personal de la compañía. Este tipo de redes se restringen con el uso de software y se usan en situaciones en las que la información a la que pueden acceder los usuarios es confidencial.</p><p>Extranet</p><p>El siguiente nivel de acceso sucede cuando las compañías requieren dar acceso seguro y bajo confidencialidad a usuarios externos incluso a organizaciones diferentes a la que posee la información.</p><p>Esto puede pasar por ejemplo cuando una compañía requiere compartir documentos o información con proveedores o contratistas.</p><p><strong>Topologías de Red y sus usos</strong></p><p>La topología de red nos permite identificar la forma en que los nodos están conectados y la información se envía a través de los medios y de los nodos para viajar de un lugar a otro.</p><p>La topología mas rápida de implementar y de ver es cuando tenemos dos nodos conectados por un medio para enviar información esta es llamada Punto a Punto, un punto envía información al otro.</p><p>Luego tenemos otras topologías, veamos algunas de sus características y ventajas.</p><p><strong>Topología de bus</strong></p><p>Este tipo de topología es el mas usado en redes de tipo LAN. En esta topología los nodos están conectados a un mismo medio que transporta la información.<br>La ventaja de este tipo de red es que es fácil de implementar y puede crecer rápidamente sin tener que hacer cambios bruscos a la red.</p><p><br>Esto aunque es una gran ventaja y seguro le facilita la vida al administrator de la red, presenta dos inconvenientes uno es que el tráfico de todos los nodos puede ser visto por los otros y a medida que la red crezca se va a ver afectado el rendimiento.</p><p><strong>Topología de anillo</strong></p><p>Este tipo de topología consiste en que cada nodo tiene una única conexión de entrada y una conexión de salida. Un token de confirmación viaja a través de cada nodo avisando que se envió y fue recibida correctamente.</p><p><br>Este tipo de topología aunque garantiza el envío de la información puede llegar a ser un poco lenta ya que ésta debe pasar por cada nodo intermedio antes de alcanzar su objetivo. En el caso de que uno de los nodos fallé esto puede afectar el funcionamiento de la red.</p><p><strong>Topología de estrella</strong></p><p>En esta topología todos los nodos están conectados a un punto central, esta implementación permite garantizar el funcionamiento de la red, de forma que si alguno de los nodos falla esto no va a afectar para nada el funcionamiento ni el rendimiento de la red.</p><p><br>Esta topología se usa mucho en redes LAN por ejemplo de oficinas en las que hay un switch al que llegan todas las conexiones de los dispositivos a través de cable.<br>Es una topología que permite agregar nodos nuevos siempre que el dispositivo central lo permita, sin embargo en caso de que el nodo central falle toda la red dejará de funcionar.</p><p><strong>Topología de malla</strong></p><p>En las topologías de tipo malla todos los nodos están conectados entre sí, este tipo de conexión permite que cada nodo pueda actuar como servidor y como cliente, esta es una forma óptima de mantener la conexión entre dispositivos en una red ya que se reduce a uno cantidad de dispositivos por los que debe viajar la información de un dispositivo a otro y en caso de que un nodo de la red falle los datos pueden ser enviados por otro camino lo que asegura disponibilidad.</p><p><strong>Topología de árbol</strong></p><p>En esta topología contamos con varios dispositivos intermedios que permiten que otros nodos se conecten. Por ejemplo podemos tener un punto inicial que recibe la conexión a Internet desde el ISP, de allí viaja por el medio a un switch que distribuye a otros dispositivos que pueden ser nodos u otros dispositivos intermedios, switches, routers etc quienes a su vez envían los datos a otros dispositivos iguales.</p><p>La forma de la red se parece mucho a un árbol.</p><p>También podemos hacer combinaciones de estas topologías para realizar nuestras propias implementaciones de acuerdo con las necesidades de los usuarios.</p><p></p><p><strong>Tecnologías de acceso a internet: Banda Ancha y velocidad de Internet:</strong></p><p><br>Teniendo en cuenta que un bit puede ser un 0 o un 1 tenemos que:<br>1 Kilobit (Kb-Kbit) = 1000 bits (b)<br>1 Megabit (Mb) = 1000 Kilobits (Kb)<br>1 Byte (B) = 8 bits (b) =&gt; Al byte también lo llaman octeto<br>1 Kilobyte (KB) = 1024 Bytes (B)<br>1 Megabyte (MB) = 1024 Kilobytes (KB)</p><p>Mi velocidad a : 20 Mbps<br>De Mb -&gt; B<br>20 Mb = 2 500 000 B<br>De B a KB<br>2 500 000 B = 2441.41 KB<br>De KB a MB<br>2441.41 KB = 2.44141 MB<br>Velocidad en MB = 2.44</p><p>Formula para saber cuantos Mbytes de velocidad te vende tú proveedor de Internet:</p><p>ISP–&gt; 6Mb/s</p><p>6.000.000b x 1B/8b=750.000B</p><p>750.000B x 1KB/1024B=732,421875KB</p><p>732,421875KB x 1MB/1024KB=0,71MB</p><p>Velocidad de descarga 0,71MB</p><p></p><p><strong>La Red Convergente:</strong></p><p>Cómo su palabra lo indica convergen, en la que podemos trasmitir tanto la voz, los datos y video, por el mismo medio y ser utilizadas consecutivamente sin necesidad de una infraestructura para cada una de ellas, como era antes, además del menor coste de mantenimiento de las infraestructura.</p><p>Podemos poner como ejemplo las líneas ADSL, en las cuales conviven los tres servicios conjuntamente, por las cuales se transmite la voz por el medio de cobre, con el que convive la transmisión de datos, por los que además se transmiten los servicios de TV, como puede ser la televisión bajo demanda o streaming.</p><p>Eso es lo que podemos decir que es una red convergente. La interacción de varios servicios de comunicación por un solo medio.</p><p></p><p><strong>¿Qué es Telnet?</strong></p><p>El protocolo Telnet, acrónimo de “Telecommunication Network”, es un protocolo de red que permite comunicarse en modo texto con otra máquina de manera que podamos controlarla de forma remota. Este protocolo se basa en la arquitectura cliente-servidor, donde el servidor será el ordenador que vamos a manejar y el cliente el ordenador desde el que vamos a controlar el servidor.</p><p>Este es un protocolo muy simple, sin embargo, cuenta con grave problema de seguridad, y es que las conexiones no son seguras, y el tráfico viaja sin cifrar.</p><p><strong>¿Qué es SSH?</strong></p><p>SSH o Secure Shell, es un protocolo de administración remota que permite a los usuarios controlar y modificar sus servidores remotos a través de Internet. El servicio se creó como un reemplazo seguro para el Telnet sin cifrar y utiliza técnicas criptográficas para garantizar que todas las comunicaciones hacia y desde el servidor remoto sucedan de manera encriptada. Proporciona un mecanismo para autenticar un usuario remoto, transferir entradas desde el cliente al host y retransmitir la salida de vuelta al cliente.</p><p>Cualquier usuario de Linux o macOS puede hacer SSH en su servidor remoto directamente desde la ventana del terminal. Los usuarios de Windows pueden aprovechar los clientes SSH como Putty. Puede ejecutar comandos shell de la misma manera que lo haría si estuviera operando físicamente el equipo remoto.</p><p>Por defecto SSH usa el puerto 22 y Telnet utiliza el puerto 23, una medida básica de seguridad es configurarlos en otros puertos que no sean los establecidos por defecto.</p><p></p><p><strong>Aspectos básicos de comunicación</strong></p><p>Los elementos básicos de la comunicación son: El emisor, el mensaje, el canal o el medio y el receptor. Los protocolos son las normas que nos indican establecer una comunicación que sea efectiva. Necesitamos establecer protocolos que nos ayuden a ver que la información pasen por todas las capas que tiene los procesos de comunicación.</p><ul><li>Los protocolos son las reglas que rigen la comunicación.</li><li>Los protocolos determinan las siguientes características:</li><li>Codificación del mensaje</li><li>Formato y encapsulamiento del mensaje</li><li>Tamaño del mensaje</li><li>Sincronización</li><li>Opciones de entrega</li></ul><p>El formato y la estructura del mensaje, la información que queremos transmitir debe tener una forma para que pueda ser enviada por el medio que queremos enviarlo.</p><p>Tamaño del mensaje: Las señales muy grandes no son transmitidos, son rechazados. El tamaño es importante y se es limitado.</p><p>Sincronización: Contamos con protocolos que nos ayudan a determinar cuando se esta enviando un mensaje, que ya llego un mensaje, que se puede llegar otro.</p><p>Opción de entrega: Unicast se le envía a un solo host, Multicast permite enviar a un grupo más pequeño, no a todos los host, Broadcasting nos envía paquetes a toda la red.</p><p><strong>Suites de protocolos</strong></p><p>Una suite de protocolos es un conjunto de protocolos que nos ayudan desde las diferentes capas y servicios de la red a garantizar que la información viaja de un lugar a otro, de forma segura y confiable, algunos de estos sirven para garantizar que la información es entregada o no como lo son TCP y UDP.</p><p>En la siguiente clase estaremos hablando de los modelos de referencia para la transmisión de datos en Internet, el modelos OSI y el modelos TCP/IP. Veremos que son similares y una de las cosas por las que esto es así es porque los protocolos que ambos usan en sus capas son protocolos abiertos, de uso libre, de forma que pueden estar implementados en cualquier dispositivo de hardware o a través de software.</p><p>A continuación listo algunos de los protocolos usados en las diferentes capas de red y su funcionamiento:</p><p><strong>De la capa de Acceso a la Red (TCP/IP) / Física + Enlace de Datos (OSI)</strong></p><p><strong>ARP</strong></p><p>Es el protocolo que permite hacer la asignación de direcciones físicas y direcciones lógicas en el modelo OSI funciona en la capa de Enlace a Datos en la capa lógica.</p><p><strong>Ethernet</strong></p><p>Es el protocolo que nos permite definir los estándares relacionados con los medios cableados y la señalización en la capa de Red.</p><p><strong>Controladores de NIC</strong></p><p>Corresponde a la definición de los algoritmos que llevan las instrucciones a la máquina para recibir y enviar datos a través de la tarjeta de acceso a Internet del dispositivo.</p><p><strong>Capa de Internet (TCP/IP) / Capa de Red (OSI)</strong></p><p>IP</p><p>Protocolo de Internet, es el protocolo encargado de la asignación de direcciones lógicas a los dispositivos, recibe los segmentos de la capa de transporte y los direcciona a través de la red.</p><p>NAT</p><p>Network Address Translation, es te protocolo hace la traducción de direcciones IP privadas en direcciones IP públicas únicas globalmente.</p><p><br>Es un protocolo que permite a los routers enviar mensajes a través de Internet. Cada dispositivo en la red LAN sale a Internet a través de un dispositivo llamada Router que contiene un listado de direcciones IP privadas vs direcciones IP públicas.</p><p><br>Cuando un host quiere enviar un mensaje a un dispositivo externo el router determina a través de NAT a donde debe enviar.<br>Con el uso de direcciones IPv6 se espera que el uso de este protocolo no sea necesario ya que es posible asignar a cada host en en el mundo una dirección lógica única.</p><p>ICMP</p><p>Este protocolo apoya al protocolo IP proporcionando mensajes y notificaciones de error cuándo un mensaje no puede alcanzar su destino. Valida que el mensaje haya alcanzado su destino, valida también si la el tiempo de vida del mensaje ya ha sido superado entre otras cosas. Su labor es únicamente informar sobre el error sin ejecutar acción alguna para resolverlo.</p><p>Capa de Transporte (TCP/IP) / Capa de Red (OSI)</p><p>Los protocolos de esta capa son TCP y UDP, de ellos estaremos hablando mas adelante en el curso.</p><p>Capa de Aplicación (TCP/IP) / Capa de sesión + Capa de Presentación + Capa de Aplicación (OSI)</p><p>DNS</p><p>Domain Name System, es el protocolo encargado de hacer la traducción de direcciones IP (172.217.14.163) en textos que podamos leer y recordar fácilmente como <a href=\"http://www.google.com/\">www.google.com</a></p><p>DHCP</p><p>Es el protocolo encargado de asignar direcciones IP de forma dinámica a los dispositivos. Esta pendiente de liberar las direcciones cuando estás ya no están siendo usadas.</p><p>SMTP</p><p><br>Este es un protocolo de envío de correo, pongo en negrita la palabra porque este es precisamente su funcionamiento, tanto desde los hosts como desde los servidores, el protocolo SMTP es en encargado de enviar los mensajes.</p><p>POP</p><p>Junto con IMAP, POP es un protocolo encargado de la recepción de los mensajes en el dispositivo de destino. POP descarga los mensajes desde el servidor a tu pc y son eliminados del servidor. Si recibes un mensaje usando el protocolo POP ese mensaje puede ser consultado sin conexión a Internet luego de ser descargado al pc, pero si se borra de tu pc ya no hay manera de recuperarlo.</p><p>IMAP</p><p>El otro protocolo para recuperación de correo, en este caso los mails son revisados desde el servidor, de forma que se requiere conexión a Internet para leer los mensajes, puedes acceder a tus mails desde diferentes dispositivos y no tienes que preocuparte por la recuperación ya que el servidor realiza copias de seguridad para garantizar que el mail sigue disponible.</p><p>FTP/TFTP</p><p>Son protocolos para transferencia de archivos.</p><p>HTTP/HTTPS</p><p>Este es tal vez el protocolo que todos sabemos que es familiar, porque es el que usamos todo el tiempo siempre que estamos consultando información en internet. El protocolo HTTP es el conjunto de reglas que definen la forma en que son enviados los mensajes para el intercambio de texto a través de la red.</p><p></p><p>Y estos son algunos conceptos que tiene las redes de internet.</p>","slug":"redes-de-internet","createdAt":"2020-09-19T17:20:18.000+00:00","id":"5f663dd2c599c9001eb5a3fc","desc":"Artículo básico sobre internet.","tag":"tech","image":null},{"title":"Cómo ocultar archivos y carpetas en equipos Mac","html":"<p></p><p>Si quieres que tus archivos desaparezcan de la vista de las personas, a menudo piensas que la mejor manera es encriptarlo o utilizar programas que hará dificil encontrar tu fichero. Sin embargo los dispositivos Mac ofrecen un método que puedes usar para esta labor.   </p><p>Los equipos MacOS  permiten a los usuarios emplear una funcionalidad del sistema para ocultar archivos dondé involucran la Terminal. Es cierto que existen aplicaciones que ejecutarán comandos detrás de una interfaz gráfica que realiza la misma tarea obteniendo los mismos resultados, sin embargo con está opción no necesitarás instalar ningun programa.</p><p><strong>Pasos para ocultar archivos y carpetas</strong></p><ul><li>Abrir la Terminal.</li><li>Luego se debe escribir el siguiente comando, pero no presionar la tecla \"Enter\" todavá:</li></ul><!--kg-card-begin: html-->chflags hidden<!--kg-card-end: html--><p></p><ul><li>Después  se debe arrastrar el archivo o carpeta que desea ocultar a la ventana de Terminal.</li><li>Una vez que la ruta aparezca en la ventana de Terminal, presione \"Enter\" para configurar la bandera oculta.</li><li>Elimine la bandera oculta con el mismo proceso, pero cambie el comando a <strong>chflags nohidden</strong> en su lugar.<br><br></li></ul><p><strong>Ocultar con un periodo de tiempo </strong></p><p>Los nombres de archivos o carpetas que comienzan con un punto (\".\") Se ocultan automáticamente en Finder.  Sin embargo puedes usar Terminal para agregar un punto al principio del nombre de cualquier archivo o carpeta, ocultando el archivo de la vista casual. </p><ul><li>Abrir Terminal.</li><li>Navegue a la carpeta que contiene el archivo que desea ocultar en Terminal usando el comando cd.</li><li>Utilice el comando mv para \"mover\" el archivo que desea ocultar de su nombre actual a uno que comience con un punto, así:</li></ul><!--kg-card-begin: html-->mv myfile .myfile<!--kg-card-end: html--><p></p><p>No parece mucho, pero esto ocultará inmediatamente el archivo.</p><p>la froma de revertir el proceso, es solo escribiendo el siguiente comando: </p><!--kg-card-begin: html-->mv .folder folder<!--kg-card-end: html--><p></p><p><strong>Configuración del atributo de visibilidad en invisible</strong></p><p> Sí tienes  Xcode o las herramientas de Desarrollo de Apple instaladas, puedes también usar para realizar el atributo de visibilidad.</p><ul><li>Abrir el  Terminal.</li><li>Luego se debe escribir el siguiente comando, pero no presionar la tecla \"Enter\" todavá:</li></ul><!--kg-card-begin: html-->setfile -a V<!--kg-card-end: html--><p></p><ul><li>Después  se debe arrastrar el archivo o carpeta que desea ocultar a la ventana de Terminal.</li><li>Presione \"Enter\" para ejecutar el comando y ocultar el archivo.</li><li>Para deshacer el comando, cambie la V mayúscula a una v minúscula así:</li></ul><!--kg-card-begin: html-->setfile -a v file.txt<!--kg-card-end: html--><p></p><p><strong>Revelar archivos ocultos en Finder</strong></p><p>Bloquear una puerta no sirve de mucho si no puede también desbloquearla. Hay dos formas principales de hacerlo, y ambas revelarán todos los archivos ocultos, independientemente del método utilizado para ocultarlos.</p><p><br>Ambos tienen exactamente el mismo efecto, y el segundo suele ser más fácil de recordar y ejecutar sobre la marcha.</p><p><br>Por supuesto, los usuarios avanzados sabrán que siempre puede ver archivos y carpetas ocultos en Terminal con ls -l. También puede utilizar el comando \"Ir a la carpeta\" de Finder para navegar directamente a una carpeta oculta, siempre que sepa la ruta exacta.</p><p><br><strong>Terminal</strong></p><p>Ejecute el siguiente comando en Terminal para revelar todos los archivos ocultos. los valores predeterminados escriben com.apple.finder AppleShowAllFiles TRUE; killall Finder</p><p>Finder se reiniciará después de ejecutar este comando, así que asegúrese de no estar en medio de vaciar la papelera o copiar archivos.<br>Cuando haya terminado, vuelva a ocultar los archivos cambiando el VERDADERO en el comando anterior a FALSO, así:</p><p><br>los valores predeterminados escriben com.apple.finder AppleShowAllFiles FALSE;</p><p> killall Finder</p><p><br><strong>Finder</strong></p><p>Abra una ventana del Finder y presione Comando + Mayús + Punto. Esto revelará todos los archivos ocultos.</p><p>Oculte los archivos nuevamente presionando el mismo comando de teclado: Comando + Mayús + Punto.</p><p><br><strong>Ocultar en carpetas del sistema</strong></p><p><br>También puede ocultar archivos colocándolos en carpetas del sistema. Este es el tipo de truco que puede usar para ocultar materiales para adultos de un padre fisgón, pero de todos modos es efectivo.</p><p><br>De forma predeterminada, la carpeta Biblioteca está oculta en macOS. Esto lo convierte en un lugar útil para guardar archivos y será de fácil acceso.</p><p>Haga clic en el menú \"Ir\" en el Finder.</p><p>Mantenga presionada la tecla \"Opción\" para revelar la opción de menú \"Biblioteca\".</p><p>Haga clic en \"Biblioteca\" para navegar a la carpeta.</p><p>Cree una nueva carpeta dentro de la carpeta Biblioteca y asígnele el nombre que desee.</p><p>Coloque sus archivos sensibles dentro de ese directorio.<br>Para mayor seguridad, puede colocar su directorio oculto dentro de varias carpetas con nombres crípticos. Sin embargo, tenga cuidado de no ocultarlo dentro de carpetas que las aplicaciones usen activamente. Dejar archivos aleatorios en \"Biblioteca / Soporte de aplicaciones\" puede tener consecuencias inesperadas.</p><p><br><strong>Conclusión</strong></p><p><br>Estas técnicas solo ocultarán archivos a los usuarios de computadoras más novatos. Si está harto de que un amigo o un miembro de la familia busque casualmente entre sus cosas, este tipo de protección probablemente sea suficiente. Pero tenga en cuenta que estas técnicas no le ofrecen protección contra un intento serio de un profesional capacitado o incluso un aficionado con conocimientos. No olvide que también puede cifrar archivos individualmente o cifrar toda la imagen de su disco</p>","slug":"how-to-hide-files-and-folders-on-your-mac","createdAt":"2020-09-19T04:07:51.000+00:00","id":"5f6584175fd029001e62a22e","desc":"Cómo ocultar tus archivos y carpetas en tu Mac.","tag":"tech","image":null},{"title":"Consigue tomar Fotografías grandiosas con tu teléfono","html":"<p></p><p>Puedes hacer fotos muy buenas con solamente tu teléfono. Es una pregunta que a veces nos hacemos.  Siendo honesto creo que cualquier dispositivo puede ayudarnos a darle vida a lo que queremos capturar, hay una frase que me gusta y es “la cámara no hace al fotógrafo”, a la final es solamente un recurso para empezar a contar historias. Solo se debe conocer las reglas básicas de composición, los tipos de fotografía y técnicas de edición.</p><p>Lo primero que debes hacer es “ver”, es decir, debes buscar inspiración en cada oportunidad que puedas, ya seá con el paisaje, te sorprendería las fotos que puedes tomar de cosas tan sencillas y simples. También, ten en cuenta que cada uno decide cómo quiere transmitir su mensaje, la fotografía es subjetiva a excepción del fotoperiodismo donde debes mostrar la foto la cual fue tomada.</p><p><br><strong>¿Qué es fotografía Móvil?</strong></p><p>Es aquella fotografía que tomamos con nuestro teléfonos inteligentes. Un dato curioso es que el 63% de las publicaciones en redes sociales son imágenes, que en su mayoría son tomadas por dispositivos celulares. Ahora  me gustaría presentarte las ventajas y desventajas que tiene tomar fotografías con nuestro móvil:</p><p><strong>Ventajas:</strong></p><ul><li>Discreción</li><li>Ligero</li><li>Facilidad de uso</li><li>Siempre contigo</li><li>Tamaño</li><li>Mejora continua</li><li>Editor en el mismo dispositivo</li></ul><p></p><p><strong>Desventajas:</strong></p><ul><li>Necesitas mucha luz</li><li>Calidad de la imagen</li><li>No se puede cambiar la óptica</li><li>Precio del dispositivo (depende)</li></ul><p></p><p>Creemos que es mejor tomar fotos con cámaras profesionales, y tienen toda la razón, sin embargo, puedes hacer fotografía móvil desde un dispositivo Android o IOS con los mismo resultados. Para eso debemos tener encuenta lo siguientes tips:  Ajustar de la cámara, desactivar temporizador y el Flash. Foto animada (android) o iPhoto (IOS), lo ideal es que nunca uses zoom digital. </p><p>Modos de la cámara en Android como el modo retrato: es muy útil cuando queremos desenfocar el fondo. La foto panorámica permite captar información que de otra forma sería imposible o muy difícil. Google lens permite buscar imágenes directamente con la foto que tomaste (exclusivo de android).</p><p>También puedes encontrar modo automático, time lapse, cámara lenta, entre otros.</p><p><strong>Tipo de fotografía</strong></p><ul><li>Fotografía de paisajes (urbano o rural)</li><li>Fotografía de calle</li><li>Fotografía de viaje</li></ul><p>La golden hour ( hora dorada) te da tonos muy cálidos o amarillos con sombras  más difuminadas, y ocurre justamente antes del atardecer, lo cuál debes recordar para realizar una foto genial.</p><p><br><strong>Composición para móviles</strong></p><p>Algunos lineamientos básicos:</p><ul><li>Regla de los tercios.</li><li>Línea del horizonte.</li><li>Espacio negativo.</li><li>Encuadre natural.</li><li>Punto de fuga.</li></ul><p><strong>Formatos.</strong></p><p>Debes considerar las unidades de medida y observar la proporción. Estos formatos están aplicados a la fotografía móvil:  1:1 , 2:3 , 3:2 , 4:3 , 3:4 , 16:9 , 9:16</p><p><strong>Consejos. </strong></p><p>Al momento de tomar una fotografía debes procurar que tu óptica esté limpia, la cámara no debe tener suciedad, por eso es importante limpiar la lente de la cámara antes de tomar una foto, además debes analizar cuántos sensores tiene tu teléfono lo que te permitirá capturar buenas fotos. Igualmente es necesario que el espacio dondé te encuentres tenga mucha luz ya que los sensores de los teléfonos son pequeños generalmente. </p><p>También, es fundamental que no ubiques a tu personaje directamente frente a los rayos del sol, esto harán que tus fotos no queden bien y com mucha luz. Además, Recuerda ¡ no utilices él flash!</p><p> Debes buscar la posición más adecuada que te brinde estabilidad y no utilices zoom digital, lo recomendable es usar el zoom óptico. </p><p>Antes de tomar una foto, pregúntate, ¿qué quiero comunicar?</p><p>¡Aprovecha las reglas de composición!</p><p><br><strong>Raw en Android y activar cuadrícula</strong></p><p>Raw es un archivo crudo y tiene la mayor cantidad de información posible de tu foto ( por tal motivo es más pesada). Luego podrás aprovecharla mejor en otros formatos. Sacando ventaja al formato RAW en tu teléfono.</p><p>Con la posibilidad de disparar en formato RAW desde nuestros teléfonos llega la batalla frontal entre las cámaras compactas y los <em>smartphones</em>. Y es que hoy en día nuestros teléfonos tienen una cámara con mejores prestaciones y con la posibilidad de tomar fotografías en modo RAW nos permite sacar una mayor ventaja al momento de la edición.</p><p>RAW quiere decir <strong>crudo</strong> en inglés, lo que significa que se trata de un formato <em>sin procesar</em>, es decir, captura una imagen sin ningún tipo de procesamiento. El formato RAW guarda la mayor cantidad de información posible en archivo que luego de un proceso (el revelado) podremos obtener un archivo en formato de imagen (JPG, PNG, etc).</p><p>Los archivos RAW que crean los teléfonos inteligentes suelen tener una extensión de archivo DNG (<em>Digital Negative</em>), este tipo de archivo fue creado por Adobe en 2004 y en el conserva toda la información capturada con el sensor por lo que en lugar de tener unos 8 bits por canal (24 bits/píxel) como los archivos JPG ya procesados, tiene entre <a href=\"https://www.dpreview.com/forums/thread/4340550\">10 y 16 bits por canal</a> (entre 40 y 48 bits/píxel).</p><p>Esto significa que cada píxel de un archivo RAW que compone la imagen contiene más información que los píxeles de una imagen en formato JPG, por tanto tienes un margen más amplio para mejorar la calidad de la fotografía al momento de la edición, es decir, al momento del revelado utilizando una aplicación en tu teléfono.</p><p>Cuando tomas una fotografía desde tu teléfono lo que sucede es que el sensor recoge toda la información posible y la manda en formato RAW al software de procesamiento de la cámara que tenga tu sistema operativo. Este software tiene una serie de ajustes y calibraciones que de manera inmediata le aplica ciertos parámetros como la exposición, el brillo, el contraste, las sombras, la temperatura del color y otras más lo que hace que guarde de manera automática una fotografía JPG en la galería de tu teléfono.</p><p>Lo anterior, significa que tu teléfono está prácticamente haciendo de manera automática el revelado digital de un archivo RAW. Esto se aplicó en un inicio para guardar versiones más ligeras de los archivo y por qué gran parte de los usuarios no necesitan almacenar un archivo en RAW que pesa más de 20MB.</p><p>Hay que tomar en cuenta que cuando no disparamos en RAW estamos dejando que el fabricante de nuestro teléfono realice los ajustes básicos al momento de tomar una fotografía. Esto en función de distintos criterios que el software considera para lograr los resultados más óptimos al momento de tomar fotografías, ahora bien, esto no es necesariamente malo, los resultados son bastante buenos. Lo único que hay que tener en cuenta es que nosotros podemos hacer todos esos ajustes y preparar una fotografía para obtener el resultado tal como consideramos que transmite lo que queremos comunicar con ella.</p><p><strong>Ventajas y desventajas del modo RAW</strong></p><p><strong>Ventajas</strong></p><ul><li><strong>El formato RAW no comprime la imagen</strong>. Guardamos toda la información posible que nos envía el sensor de nuestro teléfono</li><li><strong>Nos ayuda a hacer una mejor post producción</strong>. Dado que tenemos toda la información almacenada en el archivo podemos realizar los ajustes sin que exista una perdida de calidad en la imagen, esto significa que si tomamos una foto cono poca luz por ejemplo y esta tiene un poco ruido que queremos eliminar, el resultado será mucho mejor que si hubiésemos tomado la fotografía en JPG.</li></ul><p><strong>Desventajas</strong></p><ul><li><strong>El tamaño de los archivos</strong>. El formato RAW puede llegar a pesar 20MB por archivo. Esto quiere decir que si tomamos muchas fotografías la memoria de nuestro teléfono se llenará muy rápidamente.</li><li><strong>Es necesario hacer un proceso de revelado</strong>. Así como la edición de nuestra fotografía y los resultados que podemos obtener con ella son una gran ventaja, esto puede volverse una desventaja si tenemos más de 200 fotografías que hay que pasar por revelado antes de obtener un archivo en JPG. Recordamos que él RAW es un formato de archivo, no una imagen. Por tanto, hay que revelar.</li></ul><p>Ahora bien, a continuación les presentaré una aplicación que nos ayudarán a sacar ventaja al momento de disparar en RAW desde nuestro teléfono. Y lo mejor de todo es que está app está disponible tanto para iOS como para Android.</p><p><strong>Snapseed (Gratuita)</strong></p><p><a href=\"https://support.google.com/snapseed?hl=es-419#topic=6155507\">https://support.google.com/snapseed?hl=es-419#topic=6155507</a></p><p>Esta aplicación fue adquirida por Google hace algún tiempo y es gratuita. Si bien esta aplicación no nos permite tomar una fotografía en RAW, también nos permite editarla utilizando nuestro teléfono. Con snapseed podemos hacer el revelado de nuestra fotografía haciendo ajustes como Exposición, sombras, contraste, resaltar el brillo, ajustar la saturación, corregir la temperatura y otras más. Tiene una herramienta muy útil para el ajuste de blancos.</p><p>Una de las características principales de esta aplicación es que nos muestra un histograma visible todo el tiempo.<br></p><p>Ahora hay muchos conceptos que pueden resultar abrumadores pero no lo son dejen me explicarlos: </p><p>Herramientas de edición: Exposición, contraste, ajuste, enfoques y claridad.</p><p>Exposición: una foto está muy bien expuesta cuando se puede apreciar todos los elementos que el fotógrafo quiere mostrar.</p><p>Contraste: hace que los tonos claros se vean más claros y los oscuros más oscuros.</p><p>Ajuste: configura el encuadre de tal manera que sea simétrico con la composición que buscamos.</p><p>Enfocar: es muy similar a la nitidez. Las líneas son más definidas.</p><p>Claridad: resalta los bordes.</p><p>Saturación: hace que los colores sean más intensos.</p><p>Tono: aumenta o disminuye el brillo de los parámetros resultados y sombras.</p><p>Balance de blancos: hace que los blancos sean totalmente blancos. Con la opción temperatura puede hacer el tinte hacemos que los tonos verdes o morados sean más menos fuertes.</p><p>Tono de piel: puede configurar el tono de piel de los personajes desde tonos más rosas a más bronceados.</p><p>Viñeta: oscurece los bordes.</p><p>Grano: agrega un efecto de ruido o impurezas.</p><p>Difuminar: permite hacer un lavado de color, da un efecto retro</p><p>Tono separado: dependiendo del color podemos elegir un color para los resultados y otro para las sombras.</p><p>Bordes: permite añadir borde en un marco específico.</p><p>HSL: ajusta la tonalidad, saturación y luminosidad de un color específico.</p><p></p><p><strong>Editando un retrato.</strong></p><p><br>El ajuste del encuadre debe estar basado en alguna regla de composición. Preferiblemente no mutiles el cuerpo de tu personaje principal y ubica todos los elementos que quieres dentro del encuadre. Recuerda, la exposición, tono de piel, viñeta o filtros deberá ser acorde al mensaje que quieras transmitir.</p><p></p><p><strong>Editando una fotografía de paisaje</strong></p><p>Antes de tomar cualquier fotografía, es importante que visualices cómo quieres que sea el resultado final. Recuerda puedes usar las reglas del horizonte y los tercios para este tipo de fotografías. También amplifica el mensaje de tu foto al manipular la temperatura y los filtros.</p><p></p><p><strong>Editando fotos de comida</strong></p><p>Consejos:</p><ul><li>Pon el teléfono perpendicularmente a la mesa (desde arriba)</li><li>Agrega más elementos aparte de la comida de tal forma que se involucren en tu mensaje.</li><li>Foto marco, acércate lo más posible omitiendo elementos que no aportan.</li><li>Procura que el plato salga completo.</li><li>Recuerda mantener un estilo o filtro constante si vas a tener una colección de imágenes en tus redes sociales.</li></ul><p></p><p><strong>Editando una fotografía con bajas condiciones de luz</strong>.</p><p>Cuando usas flash de tu cámara matas la atmósfera, la esencia, por lo quemes mejor una foto sin flash para mantener las condiciones originales en las que fue tomada. Si una foto es difícil de aprovechar, puedes usar un filtro blanco y negro para darle un toque artístico.</p><p>Editando fotografías en lote</p><p>Con esta característica puedes acelerar tu proceso de edición, al aplicar en varias fotos a las  vez un ajuste creado por ti.</p><p>Estás son las bases necesarias para tomar fotografía con nuestros teléfonos móviles, espero que seá de utilidad.<br></p>","slug":"untitled","createdAt":"2020-09-16T03:20:32.000+00:00","id":"5f6184806726fa001ecdb0de","desc":"Cómo tomar fotografías con tu teléfono celular y todo lo hay detrás.","tag":"tech","image":null},{"title":"Aprende a instalar HomeBrew","html":"<p></p><p>Antes de empezar, me gusataría comentar que esté post es para usuarios que tenga cualquier compuatdor de Apple.</p><p>Hace bastante años que los sistemas Linux tienen y utilizan este concepto de \"gestor de paquetes\" con el fin de centralizar un sistema que permita descargar, instalar y mantener los componentes de software necesarios para los equipos, así como sus dependencias.</p><p>Entre los más conocidos tenemos :</p><ul><li>Yum para  sistemas Red Hat y derivados (paquetes .rpm).</li><li>Apt para sistemas Debian y derivados (paquetes .deb).</li><li>Pacman para sistemas Arch (paquetes .pkg.tar.gz).</li></ul><p> Ahora tener un gestor de paquetes trae consigo muchas ventajas en terminos de seguridad e integridad, control, facilidad, velocidad, apertura, neutralidad, consistencia y estabilidad, todo esto debido a que somos responsables del repositorio de paquetes mantienen la homogeneidad, coherencia y compatibilidad de los paquetes, mejorando la estabilidad del sistema en general y ahí es dónde entra Hombrew.</p><p>Homebrew es un gestor de paquetes para OXS que simplifica la descarga, la instalación y el mantenimiento de aplicaciones en nuestros dispositivos Apple. Esté post tiene cómo objetivo mostrarté todo el potencial y sacarle el máximo partido.</p><p>Teniendo encuenta estas ventajas, pasemos a instalar homebrew en nuestro equipo (sistema operativo OSX 10.9 o superior). Lo primero que debemos hacer es abrir nuestra terminal y escribir el siguiente comando:</p><!--kg-card-begin: html-->/bin/bash -c \"$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install.sh)\"<!--kg-card-end: html--><p></p><p>Durante la instalación de Homebrew o de otros paquetes puede ser necesario aceptar la descarga de otros componentes o dependencias externas.<br>Los casos más típicos son:</p><ul><li>Herramientas de línea de comando de XCode, para construir los binarios de los paquetes que contienen códigos fuente.</li><li>Cask, una extensión de Homebrew que añade un repositorio con un enorme catálogo de aplicaciones de OSX.<br>De hecho, Cask controla la instalación de estas aplicaciones de manera separada a los paquetes Homebrew normales.</li></ul><p>Además, aunque es raro, algún instalador puede solicitar permisos de \"root\" a través del comando sudo. En estos casos, asegurarse de que se confía en la aplicación que se está instalando y que los permisos se solicitan por una razón lógica (por ejemplo porque se debe instalar algún software de sistema).</p><p><br>Si por algún extraño casual decides que Homebrew no es para ti y deseas desinstalarlo, se puede hacer con esta línea de comando desde la terminal:</p><!--kg-card-begin: html-->ruby -e \"$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/uninstall)”<!--kg-card-end: html--><p></p><p>En caso de tener alguna dificultad, puedes acceder al sitio oficial desde el siguiente link : H<a href=\"https://brew.sh\">ombrew</a></p><p>Ahora bien, cómo es un gestor de paquetes, lo segundo que haremos será buscar uno y la mejor forma es usando la línea de comandos:</p><!--kg-card-begin: html-->brew search subcadena<!--kg-card-end: html--><p></p><p>Dondé  una <em>subcadena</em> es todo o parte del nombre de la aplicación que se está buscando, por ejemplo:</p><!--kg-card-begin: html-->brew search virtual<!--kg-card-end: html--><p></p><p>Los paquetes con el prefijo Caskroom/cask/ provienen del repositorio de Cask.<br>Si solamente té interesa en buscar en aplicaciones OSX (que están en Cask), se puede simplificar la lista de resultados buscando con Cask:</p><!--kg-card-begin: html-->brew cask search subcadena<!--kg-card-end: html--><p></p><p>La instalación de un paquete se realiza con la acción install, de la cual existen dos variantes según deseemos utilizar el repositorio de Homebrew o el de Cask pero es igual que los casos anteriores:<br></p><!--kg-card-begin: html-->brew install nombre-paquete-homebrew<!--kg-card-end: html--><p><br></p><p>El nombre del paquete proporcionado debe ser el nombre completo devuelto al realizar una búsqueda con brew search o brew cask search respectivamente. </p><p>Al igual que ocurre con otros sistemas de paquetes, Homebrew actualiza casi todos los días su catálogo, tanto a nivel de metadatos como a nivel de contenidos. Para actualizar los metadatos (la lista de paquetes) se ejecutará el comando:</p><!--kg-card-begin: html-->brew update<!--kg-card-end: html--><p></p><p>Pero para tener mejor resultados podemos realizar con el siguiente comando:</p><!--kg-card-begin: html-->brew update &&  brew upgrade<!--kg-card-end: html--><p></p><p>Lo correcto es actualizar todos los paquetes y, como caso excepcional por motivos de estabilidad o compatibilidad, evitar la actualización de algún paquete.<br>Esto último se consigue fijando el estado de un paquete con la acción pin:</p><!--kg-card-begin: html-->brew pin nombre-paquete<!--kg-card-end: html--><p></p><p>Sin embargo si no queremos fijarlo podemos deshacer lo con el siguiente comando:</p><!--kg-card-begin: html-->brew unpin nombre-paquete<!--kg-card-end: html--><p></p><p>Homebrew distingue dos situaciones de eliminación de paquetes, por un lado, librarse de versiones obsoletas de un paquete y, por otro, eliminar un paquete por completo. Nunca va a eliminar ningún software de manera automática; siempre se le debe ordenar hacerlo.</p><p>La eliminación de versiones antiguas de un paquete se debe realizar con la acción cleanup:</p><!--kg-card-begin: html-->brew cleanup<!--kg-card-end: html--><p></p><p>Opcionalmente, se puede indicar el nombre del paquete a limpiar, aunque esto es poco frecuente. Por otro lado, para desinstalar completamente un paquete, se utilizará la acción uninstall con el nombre del paquete que se quiere eliminar:</p><!--kg-card-begin: html-->brew uninstall nombre-paquete<!--kg-card-end: html--><p></p><p>Para finalizar es Homebrew  no sólo traen a OSX un mecanismo unificado para el control de las aplicaciones instaladas en el sistema, sino que también aportan un canal muy importante para la difusión de software que de otro modo sería complicado obtener, instalar y mantener en nuestro equipo y eso es lo principal al tener encuenta para utilizar Homebrew.<br></p>","slug":"homebrew","createdAt":"2020-09-16T02:25:38.000+00:00","id":"5f6177a26726fa001ecdaffe","desc":"Todos los conceptos relacionados, como buscar, instalarlo y desinstalarlo esta herramienta denominada Homebrew. ","tag":"tech","image":null},{"title":"Cómo limpiar el historial y cerrar sesiones desde el terminal","html":"<p></p><p>Antes de empezar, me gustaría comentar que esté post es para usuarios que tenga cualquier compuatdor de Apple (Macbook Pro, Macbook Air, iMac).</p><p>Si frecuentemente trabajas con la terminal, como es mi caso, tal vez en ocasiones querrás limpiar todo el historial de comandos y cerrar sesiones abiertas que crea nuestro equipo.</p><p>Cada vez que utilizamos el Terminal, automaticamente se van creando un historial que nos permite recordar los comandos que implementamos, para comprobarlo simplemente pulsa la tecla \"flecha hacia arriba\", verás que puede ir paseando por los diferntes comandos que has usado anteriormente en diferentes sesiones.</p><p>Aunque  es una característica que está muy bien,  en algunos casos, es necesario no dejaar rastro de lo que has estado haciendo, especialmente por seguridad. Ahora para limpiar el historial de comandos introducidos, solo se debe abrir el terminal y usar el siguiente comando:</p><!--kg-card-begin: html-->rm ~/.bash_history\n<!--kg-card-end: html--><p></p><p>Cierra el Terminal y vuélve a abrir y verás el único comando que quedará en el historial es precisamente ese, el último que has introducido.</p><p>Bien, ahora para cerrar sesiones, es importante tener encuenta la frecuencia que usas el Terminal, es factible que un día encuentres con un mensaje que te indique que has excedido el número máximo de sesiones. Si en cualquier momento te sale un mensaje como es: </p><blockquote>You have exceeded the maximum number of shell sessions</blockquote><p>Esto puede ocurrir por que abrimos ventanas del Terminal, y en lugar de cerrar la sesión, simplemente cerramos la ventana del Terminal y a otra cosa. Lo importante es que si queremos eliminar esa advertencia y poder seguir trabajando normalmente con el Terminal debes introducir el siguiente comando:</p><!--kg-card-begin: html-->shell_session_delete_expired<!--kg-card-end: html--><p></p><p>Luego de esto, té aparecerá un texto en el que te indicará todas las sesiones que se cerraron, mostrando que se ha completado el proceso, para la próxima vez. Una vez hayas terminado, usa el siguiente comando:</p><!--kg-card-begin: html-->exit<!--kg-card-end: html--><p></p><p>De igual forma cuentas con otros comandos interesantes cómo: </p><!--kg-card-begin: html-->shell_session_update<!--kg-card-end: html--><p></p><p>El cuál te permite actualizar las sesiones abiertas, o puedes usar el siguiente comando para guardar las sesiones:</p><!--kg-card-begin: html-->shell_session_save<!--kg-card-end: html--><p><br>Y eso sería todo, espero que seá de ayuda.</p><p><br></p><p></p>","slug":"terminal","createdAt":"2020-09-16T01:16:12.000+00:00","id":"5f61675c6726fa001ecdaf63","desc":"Una de las formas de limpiar el historial y las sesiones abiertas que deja nuestro equipo Apple.","tag":"tech","image":null},{"title":"La guía para los principiantes para Live Streaming","html":"<p></p><p>La mayoria de persona utilizamos  los famosos <strong>\"live\"</strong> gracias al mundo tan conectado en el que vivimos y  la situación que se estamos atravesando en esté año 2020. </p><p>Hemos tenido que cambiar nuestros habitos de consumo, cada vez se utilizan más plataformas multimedia cómo Facebook, Youtube, Snapchat,  Netflix, Spotify, Prime video, Periscope y la muy popular Tik Tok para satisfacer alguna necesidad, pero la realidad es que sabemos poco de su funcionamiento, son pocas personas entienden y comprenden todo los conceptos que hay detrás de estas tecnologías.</p><p>Cada vez que decidimos ver una serie o pelicula en una plataforma como Netflix, estamos recibiendo una trasnmisión continua de datos los cuales se encuentran almacenados en servidores y en el momento en cual presionamos click sobre el contenido, se hace una llamada para consumir esa información, la cual será transferida al lugar donde se solicito.  Y esa es la base para definir el concepto de live streaming. </p><p>La definición sería una transmisión continua de contenido multimedia en <strong>\"tiempo real\",</strong> pero en realidad, depende de diferentes factores como la infraestructura y la velocidad de conexión. Cuando hablamos de internet, lo que decimos es que estamos haciendo una transmision en vivo, sin embargo puede existir un desfase o delay a veces de segundos o minutos, por eso, el termino tiempo real puede que no aplique.</p><p>Ahora bien, el live streaming cuenta con un Flujo que se puede apreciar en el siguiente gráfico: </p><!--kg-card-begin: html--><img src=\"https://i.ibb.co/Qb5TVCC/Flow-of-live-streaming.png\" alt=\"Flow-of-live-streaming\" border=\"0\">\n<!--kg-card-end: html--><p>Lo primero que se realiza es captura el audio y video, luego se procesa los datos para pasar a emitirse a una o varias plataformas (Facebook, Instagram, Tik Tok, etc),  lo que permite al final llegar a una audiencia, esa audiencia son todas las personas que van a seguir esa transmisión en vivo.</p><p>La mejor forma y la más facil de capturar los datos para transmitir es con nuestro smartphone y esto es gracias a que contiene todo lo que necesitamos para realizar estas tareas. Los telefonos cuentan con cámaras, micrófonos, screen recorders, switchers ( audio y video) y capturador de video. </p><p>En cuanto a emisión ya sea en <strong>hardaware</strong> y <strong>software</strong>, los dispositivos mantienen en una constante lucha de mejorar sus productos y estos a su vez, tienen todo lo necesario para permitirnos emitir el contenido debido a que agrupan los recursos que necesitamos (cámaras, micrófonos, hardware,  software, Wirecast, Laptos, Xsplit, Lightsream, Studio, OBS, equipos de Broadcast, etc), Sin embargo puedes implementar y combinar diferentes equipos como computadoras personales, teléfonos celulares dispositivos broadcast profesionales, entre otros.</p><p>Por el otro lado, tenemos una gran variedad de plataformas que nos complementan la transmisión entre ellas tenemos las siguientes:</p><ul><li>Twitch</li><li>YouTube Live</li><li>Facebook Live / Gaming</li><li>Instagram Live</li><li>LinkedIn</li><li>Periscope</li><li>Livestream</li><li>Stream Now</li><li>Broadcast Me</li><li>Alively</li><li>Hang W/</li><li>Streamago</li></ul><hr><h3 id=\"bases-t-cnicas-\">Bases técnicas:</h3><p>Las bases ténicas son las partes que necesitamos para realizar una transmisión en vivo.</p><p><strong>Containers/ contenedores:</strong></p><p>Es un conjunto de distinta información alrededor de un archivo, estos archivos pueden tener datos de audio, video y metadatos. Hay muchos contenedores dependiendo de la plataforma, la industria o el dispositivo. No les ha pasado que a veces intentan reproducir un video en su equipo de windows y no se puede abrir por falta de codecs y esto a su vez es la relación de los contenedores.</p><p>Ejemplos:</p><ul><li><strong>mov (Quick Time)</strong></li><li><strong>mp4(MPEG-4)</strong></li><li><strong>mkv(Matroska)</strong></li></ul><p></p><p><strong>Resolution / resolución: </strong></p><p>Es el tamaño en píxeles del contenido que vamos a visualizar o transmifitir.  Las dos opciones actuales, consideradas estándar, no son las más altas ni las más bajas, pero si son utilizadas y tal vez has escuchado de ellas.  </p><p><strong>1080p: 1920 x 1080 pixeles</strong></p><p><strong>720p: 1280 x 720 píxeles</strong></p><p>En estos días las mayorias de cámaras de los smartphone pueden capturar  a esas resoluciones, sin embargo existen teléfonos que tiene mayor resolución, pero es muy raro encontrar camáras que tenga una más baja de 720p, a menos que esten utilizando la camára frontal. Es importante establecer la resolución que se va implementar al momento de realizar un streaming por que con esto se sabe cuál va hacer la configuración que debe poner y no generar problemas con los usuarios al momento de visualizar.</p><p></p><p><strong>Framerate / velocidad de fotogramas por segundo</strong></p><p>Otro aspecto importante es el Framerate que son el número de capturas de fotográfia para dar movimiento, si se tiene 24 fotografias, al momento de unirlas y ejecutarlas al tiempo, se comenzará a mover. Un estandar en el <strong>Cine</strong> es de 24fps(Frames per second). Otros estandares que podemos encontrar para la televisión, es el <strong>NTSC TV</strong> qué es de 29,97fps para el caso de America y  Europa usa el estándar <strong>PAL</strong>: 25fps.</p><p>Lo primordial es tener encuenta a cuantos cuadros puede capturar nuestro dispositivo. </p><p></p><p><strong>Bitrate / Velocidad de datos</strong></p><p>Es muy importante entenderlo al momento de hacer streaming. El bitrate es la cantidad de datos usados para codificar 1 segundo de video o audio.  Por ejemplo dos megas bits por segundo, eso significa la cantidad de datos en un segundo son dos megas.  Netflix optimiza estos casos a un tasa de bitrate especifica para transmitir a la conexión con la que cuenta los usuarios, para no tener fallas y nunca se corte al momento de consumir las series y peliculas.</p><p></p><p><strong>Ancho de banda / RTMP /RTMPS</strong></p><p>Para poder transmitir la cantidad de datos, necesitamos contar con un espacio adecuado que nos permita poder llevar esos datos. Intenet funciona casi al 100% por cables submarinos, lo cuál los provedores de Internet (ISP) como claro, movistar, etc, te ofrece un espacio o canal para poder recibir y enviar datos.</p><p> Teniendo esto en cuenta la definición de ancho de banda, es la medida de datos para transmisión de información. Ahora, dentro del ancho de banda  hay dos características primordiales:  <strong>dowload</strong> y <strong>upload.</strong> </p><p>Además existen dos protocolos importantes para realizar una transmisión los cuáles son los siguientes:</p><p>RTMP (Real Time Messaging Protocol) : Es un protocolo de transferencia de mensajes en tiempo real.</p><p>RMTPS : Es el mismo protocolo pero cuenta con una conexión segura para la transferencia  en dondé todos los datos van cifrados.</p>","slug":"live-streaming","createdAt":"2020-09-10T16:37:49.000+00:00","id":"5f5a565dc90361001e65445e","desc":"Aprendiendo sobre Live Streaming. Los conceptos que abarca y cómo funciona.","tag":"tech","image":null},{"title":"Aprende a utilizar Scrapy","html":"<p>Para comenzar a implementar Scrapy  se necesita  crear un entorno en python para realizar esta tarea se hace con la siguiente linea de comando:</p><blockquote>Python3 -m venv [nombre del entorno] </blockquote><p>NOTA: se debe tener instalado python en la version 3, podemos realizarlo con el manejado de paquetes brew en el caso de contar con un macbook o con el instalador de la página oficial para los demás equipos. Además se debe tener en cuenta que el nombre del entorno por buenas practicas se debe llamar<strong> [venv]  </strong>sin embargo no es una obligación.</p><p>Después se debe ingresar al entorno con el siguiente comando, algo a tener en cuenta es el sistema operativo con el que se cuenta. Para linux y mac se debe realizar con el siguiente:</p><blockquote>source venv/bin/activate</blockquote><p>Para salir del entorno en caso de ser necesario se realiza con el siguiente comando:</p><blockquote>deactivate</blockquote><p>Para continuar se debe instalar scrapy y autopep, igualmente se debe tener actualizado el pip de python para realizar esta tarea por lo cual dejare los dos comandos para realizar estas acciones:</p><blockquote>Python3 -m pip install pip —upgrade</blockquote><p>Despise de actualizar  procedemos a instalar las herramientas que necesitamos del framework:</p><blockquote>Pip install scrapy autopep8</blockquote><p>Una vez tengamos todo esto instalado pasaremos a crear un proyecto con scrapy, de la siguiente manera:</p><blockquote>Scrapy startproject [nombre del proyecto]</blockquote><p>Cuando se haya creado el proyecto podremos ingresar en el con el comando cd, para poder utilizar e implementar el framework se debe realizar todo en la carpeta <strong>Spider</strong>, donde se creará un archivo con el nombre que quiera con la extension .py<br><strong>Ejemplo  proyecto.py</strong></p><p>Para utilizar el framework  desde la consola se puede con el siguiente comando:</p><blockquote>Scrapy shell [ ’ url’ ]</blockquote><p><strong>Ejemplo:  scrapy shell 'https://www.cia.gov/library/readingroom/historical-collections'</strong></p>","slug":"usando-scrapy","createdAt":"2020-09-10T01:40:17.000+00:00","id":"5f59840177c34b001e52469d","desc":"Aprendiendo a utilizar el Framework Scrapy de una manera simple.","tag":"tech","image":null},{"title":"The last time - Chapter one","html":"<p></p><p>Año 2019, un día antes del gran descubrimiento que cambió todo. </p><p>La noche era oscura y se encontraba lloviendo, habia bastante neblina para no visualizar nada y afuera contrastaba con el aire frío.  Se encuentran dos persona hablando misteriosamente en una base secreta China.</p><p>- ¿Está todo preparado? - preguntó un uniformado con <strong>rango de general</strong>.</p><p>- Sí, señor.  El proyecto es sólido, los cientificos y técnicos nos confirma que esta vez funcionará, las pruebas así lo demuestran - respondió el otro sujeto.</p><p>- Perfecto. Y que hay de los Rusos - preguntó el uniformado con <strong>rango de general</strong>.</p><p>- Todo indica que ellos también se encuentran haciendo experimentos, pero al parecer no ha funcionado, al igual que los Americanos. Señor, hay algo más, hemos encontrado evidencia que nos han estado espiando y tratando de conseguir nuestra tecnología. Hemos capturado a los responsables, son del grupo de espionaje  Cynthia  - respondió <strong>el otro sujeto</strong>.</p><p>-Bien, tienes mi permiso de ejecutarlos. Ahora tenemos que centrarnos en <strong>el proyecto</strong> <strong>Wunchang. </strong></p><p>Al día siguiente, todos verían el gran evento desde la amplia torre de control de la base. Altos militares, técnicos, cientificos, directivos de múltiples agencias y hasta el  Presidente de china estaban ahí. Una científica de nombre <strong><strong>Hui </strong>Y<strong>ing</strong> </strong>, revisaba complejos diagramas, grafos de comportamiento y análisis de patrones en los dispositivos. Alguien a su lado lo interrumpió.</p><p>-Ya es hora de comenzar, <strong>Hui Ying</strong>. Todos están impacientes. Esperemos que está vez funcione. - <strong>Li</strong></p><p>-Está bien, al parecer todo esta listo y funcionando. Y no tienes por que preocuparte, estoy segura que esta vez lo vamos a lograr.  <strong>Hui Ying</strong></p><p>-Espero que sí. Sabes lo que llegaría a pasar si no funciona. - <strong>Li</strong></p><p>¡Calla! - Se muy bien todo lo que esta en juego pero estoy segura que está vez  va hacer nuestro gran momento. Enciendan las maquinas doctora <strong>Li</strong>.  - <strong>Hui Ying</strong></p><p>Las motores comienzan a funcionar, mientras apuntaban a una pared extraña, parecia contener materia organica y humeda, la cual se encontraba encerrada en un cuarto enorme de <strong>vidrio</strong> compuesto de micro-aleación hecha de paladio, que permitia visualizar todo desde afuera sin representar un riesgo para la audiencia.</p><p>De repente, una enorme maquina empieza a lanzar un rayo de color azul, el cuál botaba unos chipas muy intensas a hacia la pared, lo que provoca una enorme grieta  del tamaño de una puerta de bodega, después comienza a salir unas particulas, no antes vistas, parecia como si estuviera nevando dentro del enorme cuarto que resguardaba esa pared, se torno el sitio un poco oscuro, con un ambiente muy frio y terrorífico.  Luego de apreciar tal evento y mientras todos se encontraban celebrando el hallazgo,  alguien <strong>misterioso</strong> se acerca a la doctora <strong>Hui Ying. </strong>y le pregunta por cuanto tiempo se mantiene abierto el portal. </p><p>-Solo la podemos mantener abierta por dos horas - <strong>Hui Ying</strong>.</p><p>-Muy impresionante ¡Doc!</p><p>-Parece que han logrado sintetizar el elemento. Esto será un gran avance que ni los Rusos, ni los EstadoUnidenses han podido.  Sin embargo, Aun no sabemos cómo se lo va a tomar la sociedad - <strong>Hombre Misterioso</strong>.</p><p>Por un momento el hombre comienza a mirar torre dondé encontraba el público.</p><p>-Parece que el Presidente de China y los altos rangos se encuentra felices con los resultados, pero el mundo no está listo para este descubrimiento y las demás potencias tanto como los grupos terroristas harán lo que sea posible por obtener esta información.  - <strong>Hombre Misterioso</strong>.</p><p>-No me preocupa. La republica de China, esta al tanto, y pueden neutralizar cualquier amenaza, además este descubrimiento, no saldrá de aquí, tenemos a los mejores equipos y no permitirán que la información caiga en manos equivocadas -<strong>Hui Ying</strong>.</p><p>-¡Doc! Si sabe que ayer capturaron a los espias de elite, <strong>Cynthia</strong>!  Las evidencias indican que han estado infiltrados hacia bastante tiempo, Los mejores equipos. Como usted los llama, se encuentran extrayendo toda la información que pueden, pero será complicado, esta gente tiene un entrenamiento muy duro y  preferiran morir antes que ofrecernos la información.  - <strong>Hombre Misterioso</strong>.</p><p>a... a... ah no lo puedo creer. Un momento ¿Cómo entrarón? </p><p>-Es imposible que ese grupo tan famoso de espias haya logrado ingresar a nuestras instalaciones, tiene que tener ayuda interna,. -<strong>Hui Ying</strong>.</p><p>-Ja,ja,ja, nada es imposible, ni impenetrable,  ¡<em>Observe</em>! ustedes lograron ingresar a un lugar que era imposible de entrar, sin embargo lo han hecho. Ahora viene lo más dificil, me intriga como van a sobrellevar esto. - <strong>Hombre Misterioso</strong>.</p><p>-Bueno, la inteligencia militar ni el espionaje es mi área, pero si debo admitir que me deja anonadada. Pero aunque pueda extraer la información, no podran replicar el experimento tal y como lo hemos hecho nosotros -<strong>Hui Ying</strong>.</p><p>-No estaría tan confiado, pero por ahora vamos a disfrutar el impresionante hallazgo. Se lo han ganado. No debemos dejar a nuestros invitados esperando - <strong>Hombre Misterioso</strong>.</p><p>Seis meses después del descubrimiento. Base <em>Manson,</em> Estados Unidos, Washington,  era el lugar de lanzamiento del proyecto <strong>Benjamin</strong>. Una replica del proyecto <strong>Wunchang.</strong> La joya de investigación de DARPA y NASA y a su vez la esperanza de las fuerzas militares americanas para competir contra China. </p><p>Dos horas después. </p><p>¡MALDICIÓN!  No funciona. Solo logramos abrirlo por un minuto, no es suficiente, a este paso no lograremos alcanzar a China. Hace solo seis meses que China ha hecho sus investigaciones, quién sabe que nuevos descubrimientos a logrado  - Científico <strong>Owen Hayes</strong>.</p><p>-Pero Owen, Hemos hecho un gran avance,antes no podiamos abrir el portal, creo qué estás siendo muy injusto con el equipo - Científica <strong>Leah Brown Glancy</strong>.</p><p>-No lo entiendes, Mujer. Esto es una competencia. Es una Guerra de potencias, No podemos quedar atras. Hemos hecho todo lo posible, pero sigue sin funcionar, un minuto es muy poco tiempo para explorar el sitio, Esos Chinos deben estar burlandose de nosotros, dejame solo mejor. No quiero verlos partida de ineptos - <strong>Owen Hayes.</strong></p><p>Una hora después en lugar de la base Manson, se encontraba Owen y su equipo en una reunión importante con uno de los altos mandos Militares de Estados Unidos. </p><p>¡PUTA MIERDA! No hemos logrado nada, mis superiores no van a estar contentos. Esto no habria pasado si hace meses hubieramos conseguido la información que necesitabamos. Grita un hombre completamente enojado por las fallas del equipo. Ustedes tienen misiones simples y no han conseguido nada. De repente se ve interrumpido.</p><p>¡Knock!  ¡knock! suena la puerta. La abre una Persona que se encontraba en la habitación. Y llega un sujeto usando un traje formal completamente blanco, zapatos negros, con unos ojos azules como el cielo. </p><p>¿Quién eres? No debes estar aquí. Por favor vete, nos encontramos en una reunión importante - Científico <strong>Owen</strong>.</p><p>¡NO!  Quiero que todos ustedes abandone la habitación, Voy hablar con él -  dice el general <strong>Jackson</strong>.</p><p>-Pero señor - Científico <strong>Owen</strong>.</p><p>-Ya me oiste Owen, Quiero que se ¡LARGUEN!  ¡Ya! - general <strong>Jackson</strong></p><p>El científico Owen, no entiende por que el general Jackson, los hace salir de ese modo, sin ninguna explicación. Pero recuerda que puede ser un agente externo contratado para contrabandear y extraer información valiosa. Los verdaderos espías denominados scars no son empleados de ninguna agencia y trabajan en solitario, visten de blanco y zapatos negros, se encargan de infiltrarse y sacar toda la información a los servicios de inteligencia pero que, técnicamente, no se consideran trabajadores de los mismos.</p><p>Cuando todos abandonan la habitación. Pregunta al sujeto.</p><p>-Ya era hora que aparecieras, te hemos esperado por bastante tiempo ¿ Tienes lo que te pedimos ? - general <strong>Jackson</strong>.</p><p>-No, señor -dice el <strong>Scar</strong>.</p><p>-Y entonces ¿porque te apareces así ante nosotros? - general <strong>Jackson</strong>.</p><p>-Tengo otra información que te puede interesar. Nos informan que China perdio el control de su base, algo ha salido mal, se reporta un brote de una enfermedad nueva en <em>Wuhan</em>. La Organización Mundial de la Salud (OMS) está colaborando estrechamente con el gobierno y expertos mundiales para ampliar rápidamente los conocimientos científicos sobre este virus. Aún no han notificado al mundo de la amenaza. Parece que China está intentando controlarlo - <strong>Scar</strong>.</p><p>La mirada del general se torna fría y seria por un instante, se sentía extraño en la piel del general <strong>Jackson</strong>, cuando el cerebro le reaccionó.</p><p>-¿Qué información tienes sobre esté virus? - general <strong>Jackson.</strong></p><p>- Esté no es un virus cualquiera. Es algo nunca antes visto. Es altamente contagioso, una persona puede contraer la enfermedad solo por contacto con otra persona que esté infectada. Se propaga a través de las gotículas que salen de la nariz o la boca de una persona al toser, estornudar o hablar. No llegan muy lejos estas gotículas pero si caen rápido al suelo y puede quedar sobre los objetos y superficies que rodean a la persona, además las personas pueden infectarse si tocan esos objetos o superficies. Cualquier persona que inhale las gotículas  procedentes de una persona o objeto infectada contraerá el virus.  Al parecer el jabón y el alcohol puede desinfectar los objetos. Yo de ustedes dejaría ese proyecto que estan haciendo, no les va traer nada bueno. - <strong>Scar</strong>.</p><p>-Algo más que quieras decirnos - general <strong>Jackson.</strong></p><p>-Sí hay más. Pero les costará mucho más - <strong>Scar</strong>.</p><p>-Me temo que no será posible, ahora no contamos con el presupuesto y menos ahora, después de nuestro fracaso - general <strong>Jackson.</strong></p><p>-Bien. Solo te puedo decir que es información muy importante, aunque tarde o temprano se darán cuenta de que se trata, ja,ja,ja no habra a dondé huir, creo que estamos condenados, bueno seguire con mis investigaciones. - <strong>Scar</strong>.</p><p>¡Espera! Y que hay de los Rusos - general <strong>Jackson.</strong></p><p>-Ellos se están preparando para lo que viene, no va ser fácil de enfrentar, les sugieron que hagan lo mismo - <strong>Scar</strong>.</p><p>¿Preparandose? ¿Para qué? </p><p>-No nos ha dicho mucho, y te hemos pagado bastante ¡Maldito Scar! - general <strong>Jackson.</strong></p><p>-Te he dicho lo suficiente. China no podrá contener el virus por mucho tiempo, Ellos ya tiene su chivo expiatorio pero de igual manera será el fin de la humanidad. Nunca debieron abrir esé portal, Yo de ustedes utilizariá esos recursos para hacer una fortaleza. Aunque no creo que seá suficiente Ja,ja,ja. Cuando tenga más información, les avisaré. Pero eso sí necesito más dinero, No somos muy baratos por lo que ves  ja,ja,ja,ja - <strong>Scar</strong>.</p>","slug":"chapter-one","createdAt":"2020-08-27T17:26:38.000+00:00","id":"5f47ecce245d94001e629902","desc":"Serie web de ciencia ficción, sobre un virus que cambia la vida de toda la humanidad.","tag":"history","image":null},{"title":"Consigue extraer datos de páginas web","html":"<h2></h2><p>Muchas personas piensan que extraer datos e información de los sitios web es una tarea dificil y aunque de cierta manera es verdad, es posible lograrlo siempre y cuando se tenga constancia y paciencia para aprender. Sin embargo la pregunta es ¿cómo puedo extrar la información?</p><p>La respuesta a la pregunta se encuentra en Scrapy, un framework desarrollado en Python que permite rastrear un sitio web y extraer datos de manera eficiente.Está herramienta permite encontrar la data de las páginas web y utilizarla para un procesamiento más profundo, por consiguiente se puede tomar desiciones importantes para el negocio, además de contar con espacios para almacenar la información mediante hojas de cálculo o cualquier otro programa. </p><p>Scrapy se estructura en cinco componentes principales:</p><h3 id=\"el-motor-de-scrapy\">El Motor de scrapy</h3><p>Este motor controla el flujo de datos de los demás componentes y es considerado el principal debido al poder que ofrece en la generación de peticiones y gestion de eventos contra una acción. </p><h3 id=\"planificador\">Planificador</h3><p>El componente de planificador recibe cada una de las solicitudes que envia el motor y las ograniza una por una en orden secuencial.</p><h3 id=\"descargador\">Descargador</h3><p>La finalidad del descargador es encontrar todas las páginas web y enviarlas al motor. Luego el motor enviará los sitios a las arañas.</p><h3 id=\"ara-as\">Arañas</h3><p>Las arañas son el código que se escribe para realizar el analisis y  extracción de los sitios web a buscar.</p><h3 id=\"tuber-a-de-elementos\">Tubería de elementos</h3><p>El último componente cumple la función de procesar cada uno de los elementos después de que las arañas extraen la información.</p><h2 id=\"instalaci-n-de-scrapy\">Instalación de Scrapy</h2><p>Para instalar scrapy en cualquier dispositivo es necesario contar con el lenguaje de programación Python. </p><p>Cuando se haya instalado Python, se podra instalar Scrapy con sus dependencias usando el administrador de paquetes de Python (pip) con el siguiente comando: <br></p><blockquote><em>pip install scrapy</em></blockquote><p></p><p>Para mayor información sobre la instalación y como instalar en los diferentes sistemas operativos  dirgirse al sitio oficial :  <a href=\"https://docs.scrapy.org/en/latest/intro/install.html\">Scrapy</a>.</p><p>Es recomendable instalar Scrapy en un entorno virtual debido a las dependencias del Framework pueden entrar en conflicto con otros paquetes del sistema Python lo cual podría ocasionar daños y afectar a otros scripts.</p><p></p>","slug":"scrapy","createdAt":"2020-08-27T17:14:21.000+00:00","id":"5f47e9ede15b67001e723377","desc":"Conceptos importantes del framework Scrapy.","tag":"tech","image":null}]