[{"title":"Live Streaming","html":"<p></p><p><strong>¿Qué es live streaming?</strong></p><p>La mayoria de persona utilizamos  los famosos <strong>\"live\"</strong> gracias al mundo tan conectado en el que vivimos y  la situación que se estamos atravesando. </p><p>Hemos tenido que cambiar nuestros habitos de consumo, cada vez se utilizan más plataformas multimedia cómo Facebook, Youtube, Snapchat,  Netflix, Spotify, Prime video, Periscope y la muy popular Tik Tok para satisfacer alguna necesidad, pero la realidad es que sabemos poco de su funcionamiento, son pocas personas entienden y comprenden todo los conceptos que hay detrás de estas tecnologías.</p><p>Cada vez que decidimos ver una serie o pelicula en una plataforma como Netflix, estamos recibiendo una trasnmisión continua de datos los cuales se encuentran almacenados en servidores y en el momento en cual presionamos click sobre el contenido, se hace una llamada para consumir esa información, la cual será transferida al lugar donde se solicito.  Y esa es la base para definir el concepto de live streaming. </p><p>La definición sería una transmisión continua de contenido multimedia en <strong>\"tiempo real\",</strong> pero en realidad, depende de diferentes factores como la infraestructura y la velocidad de conexión. Cuando hablamos de internet, lo que decimos es que estamos haciendo una transmision en vivo, sin embargo puede existir un desfase o delay a veces de segundos o minutos, por eso, el termino tiempo real puede que no aplique.</p><p>Ahora bien, el live streaming cuenta con un Flujo que se puede apreciar en el siguiente gráfico: </p><p>                                                <strong> Flujo de live streaming</strong></p><!--kg-card-begin: html--><img src=\"https://i.ibb.co/Qb5TVCC/Flow-of-live-streaming.png\" alt=\"Flow-of-live-streaming\" border=\"0\">\n<!--kg-card-end: html--><p>Lo primero que se realiza es captura el audio y video, luego se procesa los datos para pasar a emitirse a una o varias plataformas (Facebook, Instagram, Tik Tok, etc),  lo que permite al final llegar a una audiencia, esa audiencia son todas las personas que van a seguir esa transmisión en vivo.</p><p>La mejor forma y la más facil de capturar los datos para transmitir es con nuestro smartphone y esto es gracias a que contiene todo lo que necesitamos para realizar estas tareas. Los telefonos cuentan con cámaras, micrófonos, screen recorders, switchers ( audio y video) y capturador de video. </p><p>En cuanto a emisión ya sea en <strong>hardaware</strong> y <strong>software</strong>, los dispositivos mantienen en una constante lucha de mejorar sus productos y estos a su vez, tienen todo lo necesario para permitirnos emitir el contenido debido a que agrupan los recursos que necesitamos (cámaras, micrófonos, hardware,  software, Wirecast, Laptos, Xsplit, Lightsream, Studio, OBS, equipos de Broadcast, etc), Sin embargo puedes implementar y combinar diferentes equipos como computadoras personales, teléfonos celulares dispositivos broadcast profesionales, entre otros.</p><p>Por el otro lado, tenemos una gran variedad de plataformas que nos complementan la transmisión entre ellas tenemos las siguientes:</p><ul><li>Twitch</li><li>YouTube Live</li><li>Facebook Live / Gaming</li><li>Instagram Live</li><li>LinkedIn</li><li>Periscope</li><li>Livestream</li><li>Stream Now</li><li>Broadcast Me</li><li>Alively</li><li>Hang W/</li><li>Streamago</li></ul><hr><h3 id=\"bases-t-cnicas-\">Bases técnicas:</h3><p>Las bases ténicas son las partes que necesitamos para realizar una transmisión en vivo.</p><p><strong>Containers/ contenedores:</strong></p><p>Es un conjunto de distinta información alrededor de un archivo, estos archivos pueden tener datos de audio, video y metadatos. Hay muchos contenedores dependiendo de la plataforma, la industria o el dispositivo. No les ha pasado que a veces intentan reproducir un video en su equipo de windows y no se puede abrir por falta de codecs y esto a su vez es la relación de los contenedores.</p><p>Ejemplos:</p><ul><li><strong>mov (Quick Time)</strong></li><li><strong>mp4(MPEG-4)</strong></li><li><strong>mkv(Matroska)</strong></li></ul><p></p><p><strong>Resolution / resolución: </strong></p><p>Es el tamaño en píxeles del contenido que vamos a visualizar o transmifitir.  Las dos opciones actuales, consideradas estándar, no son las más altas ni las más bajas, pero si son utilizadas y tal vez has escuchado de ellas.  </p><p><strong>1080p: 1920 x 1080 pixeles</strong></p><p><strong>720p: 1280 x 720 píxeles</strong></p><p>En estos días las mayorias de cámaras de los smartphone pueden capturar  a esas resoluciones, sin embargo existen teléfonos que tiene mayor resolución, pero es muy raro encontrar camáras que tenga una más baja de 720p, a menos que esten utilizando la camára frontal. Es importante establecer la resolución que se va implementar al momento de realizar un streaming por que con esto se sabe cuál va hacer la configuración que debe poner y no generar problemas con los usuarios al momento de visualizar.</p><p></p><p><strong>Framerate / velocidad de fotogramas por segundo</strong></p><p>Otro aspecto importante es el Framerate que son el número de capturas de fotográfia para dar movimiento, si se tiene 24 fotografias, al momento de unirlas y ejecutarlas al tiempo, se comenzará a mover. Un estandar en el <strong>Cine</strong> es de 24fps(Frames per second). Otros estandares que podemos encontrar para la televisión, es el <strong>NTSC TV</strong> qué es de 29,97fps para el caso de America y  Europa usa el estándar <strong>PAL</strong>: 25fps.</p><p>Lo primordial es tener encuenta a cuantos cuadros puede capturar nuestro dispositivo. </p><p></p><p><strong>Bitrate / Velocidad de datos</strong></p><p>Es muy importante entenderlo al momento de hacer streaming. El bitrate es la cantidad de datos usados para codificar 1 segundo de video o audio.  Por ejemplo dos megas bits por segundo, eso significa la cantidad de datos en un segundo son dos megas.  Netflix optimiza estos casos a un tasa de bitrate especifica para transmitir a la conexión con la que cuenta los usuarios, para no tener fallas y nunca se corte al momento de consumir las series y peliculas.</p><p></p><p><strong>Ancho de banda / RTMP /RTMPS</strong></p><p>Para poder transmitir la cantidad de datos, necesitamos contar con un espacio adecuado que nos permita poder llevar esos datos. Intenet funciona casi al 100% por cables submarinos, lo cuál los provedores de Internet (ISP) como claro, movistar, etc, te ofrece un espacio o canal para poder recibir y enviar datos.</p><p> Teniendo esto en cuenta la definición de ancho de banda, es la medida de datos para transmisión de información. Ahora, dentro del ancho de banda  hay dos caracteristicas primordiales: se cuenta con un <strong>dowload</strong> y un <strong>upload</strong> </p>","slug":"live-streaming","createdAt":"2020-09-10T16:37:49.000+00:00","id":"5f5a565dc90361001e65445e","desc":"\n\n¿Qué es live streaming?\n\nLa mayoria de persona utilizamos  los famosos \"live\" gracias al mundo tan\nconectado en el que vivimos y  la situación que se estamos atravesando. \n\nHemos tenido que cambiar nuestros habitos de consumo, cada vez se utilizan más\nplataformas multimedia cómo Facebook, Youtube, Snapchat,  Netflix, Spotify,\nPrime video, Periscope y la muy popular Tik Tok para satisfacer alguna\nnecesidad, pero la realidad es que sabemos poco de su funcionamiento, son pocas\npersonas entienden ","tag":"tech","image":null},{"title":"Usando Scrapy","html":"<p>Para comenzar a implementar Scrapy  se necesita  crear un entorno en python para realizar esta tarea se hace con la siguiente linea de comando:</p><blockquote>Python3 -m venv [nombre del entorno] </blockquote><p>NOTA: se debe tener instalado python en la version 3, podemos realizarlo con el manejado de paquetes brew en el caso de contar con un macbook o con el instalador de la página oficial para los demás equipos. Además se debe tener en cuenta que el nombre del entorno por buenas practicas se debe llamar<strong> [venv]  </strong>sin embargo no es una obligación.</p><p>Después se debe ingresar al entorno con el siguiente comando, algo a tener en cuenta es el sistema operativo con el que se cuenta. Para linux y mac se debe realizar con el siguiente:</p><blockquote>source venv/bin/activate</blockquote><p>Para salir del entorno en caso de ser necesario se realiza con el siguiente comando:</p><blockquote>deactivate</blockquote><p>Para continuar se debe instalar scrapy y autopep, igualmente se debe tener actualizado el pip de python para realizar esta tarea por lo cual dejare los dos comandos para realizar estas acciones:</p><blockquote>Python3 -m pip install pip —upgrade</blockquote><p>Despise de actualizar  procedemos a instalar las herramientas que necesitamos del framework:</p><blockquote>Pip install scrapy autopep8</blockquote><p>Una vez tengamos todo esto instalado pasaremos a crear un proyecto con scrapy, de la siguiente manera:</p><blockquote>Scrapy startproject [nombre del proyecto]</blockquote><p>Cuando se haya creado el proyecto podremos ingresar en el con el comando cd, para poder utilizar e implementar el framework se debe realizar todo en la carpeta <strong>Spider</strong>, donde se creará un archivo con el nombre que quiera con la extension .py<br><strong>Ejemplo  proyecto.py</strong></p><p>Para utilizar el framework  desde la consola se puede con el siguiente comando:</p><blockquote>Scrapy shell [ ’ url’ ]</blockquote><p><strong>Ejemplo:  scrapy shell 'https://www.cia.gov/library/readingroom/historical-collections'</strong></p>","slug":"usando-scrapy","createdAt":"2020-09-10T01:40:17.000+00:00","id":"5f59840177c34b001e52469d","desc":"Para comenzar a implementar Scrapy  se necesita  crear un entorno en python para\nrealizar esta tarea se hace con la siguiente linea de comando:\n\n> Python3 -m venv [nombre del entorno] \nNOTA: se debe tener instalado python en la version 3, podemos realizarlo con el\nmanejado de paquetes brew en el caso de contar con un macbook o con el\ninstalador de la página oficial para los demás equipos. Además se debe tener en\ncuenta que el nombre del entorno por buenas practicas se debe llamar [venv]sin\nembar","tag":"tech","image":null},{"title":"The last time","html":"<p><strong>Chapter one</strong></p><p>Año 2019, un día antes del gran descubrimiento que cambió todo. </p><p>La noche era oscura y se encontraba lloviendo, habia bastante neblina para no visualizar nada y afuera contrastaba con el aire frío.  Se encuentran dos persona hablando misteriosamente en una base secreta China.</p><p>- ¿Está todo preparado? - preguntó un uniformado con rango de general.</p><p>- Sí, señor.  El proyecto es sólido, los cientificos y técnicos nos confirma que esta vez funcionará, las pruebas así lo demuestran - respondió el otro sujeto.</p><p>- Perfecto. Y que hay de los Rusos - preguntó el uniformado con rango de general.</p><p>- Todo indica que ellos también se encuentran haciendo experimentos, pero al parecer no ha funcionado, al igual que los Americanos. Señor, hay algo más, hemos encontrado evidencia que nos han estado espiando y tratando de conseguir nuestra tecnología. Hemos capturado a los responsables, son del grupo de espionaje  Cynthia  - respondió <strong>el otro sujeto</strong>.</p><p>-Bien, tienes mi permiso de ejecutarlos. Ahora tenemos que centrarnos en <strong>el proyecto</strong> <strong>Wunchang. </strong></p><p>Al día siguiente, todos verían el gran evento desde la amplia torre de control de la base. Altos militares, técnicos, cientificos, directivos de múltiples agencias y hasta el  Presidente de china estaban ahí. Una científica de nombre <strong><strong>Hui </strong>Y<strong>ing</strong> </strong>, revisaba complejos diagramas, grafos de comportamiento y análisis de patrones en los dispositivos. Alguien a su lado lo interrumpió.</p><p>-Ya es hora de comenzar <strong>Hui Ying</strong>. Todos están impacientes. Esperemos que está vez funcione. - <strong>Li</strong></p><p>-Está bien, al parecer todo esta listo y funcionando. Y no tienes por que preocuparte, estoy segura que esta vez lo vamos a lograr.  <strong>Hui Ying</strong></p><p>-Espero que sí. Sabes lo que llegaría a pasar si no funciona. - <strong>Li</strong></p><p>-Calla, se muy bien todo lo que esta en juego pero estoy segura que está vez  va hacer nuestro gran momento. Enciendan las maquinas doctora <strong>Li</strong>.  - <strong>Hui Ying</strong></p><p>Las motores comienzan a funcionar, mientras apuntaban a una pared extraña, parecia contener materia organica y humeda, la cual se encontraba encerrada en un cuarto enorme de <strong>vidrio</strong> compuesto de micro-aleación hecha de paladio, que permitia visualizar todo desde afuera sin representar un riesgo para la audiencia.</p><p>Derepente, una enorme maquina empieza a lanzar un rayo de color azul intenso a hacia la pared, haciendo que se abra un portal de ese sitio, despues de apreciar tal evento y mientras todos se encontraban celebrando el hallazgo,  alguien <strong>misterioso</strong> se acerca a la doctora <strong>Hui Ying. </strong>y le pregunta por cuanto tiempo se mantiene abierto el portal. </p><p>-Solo la podemos mantener abierta por dos horas - <strong>Hui Ying</strong>.</p><p>-Muy impresionante. Doc!</p><p>-Parece que han logrado sintetizar el elemento. Esto será un gran avance que ni los Rusos, ni los EstadoUnidenses han podido.  Sin embargo, Aun no sabemos cómo se lo va a tomar la sociedad, el Presidente de China y los altos rangos se encuentra felices con los resultados, pero el mundo no está listo para este descubrimiento y las demás potencias tanto como los grupos terroristas harán lo que sea posible por obtener esta información.  - <strong>Hombre Misterioso</strong>.</p><p>-No me preocupa. La republica de China, esta al tanto, y pueden neutralizar cualquier amenaza, además este descubrimiento, no saldrá de aquí, tenemos a los mejores equipos y no permitirán que la información caiga en manos equivocadas. Y aunque pueda extraer la información, no podran replicar el experimento tal y como lo hemos hecho nosotros -<strong>Hui Ying</strong>.</p><p>-Doc! si sabe que ayer capturaron a los espias de elite, <strong>Cynthia</strong>!  Las evidencias indican que han estado infiltrados hacia bastante tiempo, Los mejores equipos. Como usted los llama, se encuentran extrayendo toda la información que pueden, pero será complicado, esta gente tiene un entrenamiento muy duro y  preferiran morir antes que ofrecernos la información.  - <strong>Hombre Misterioso</strong>.</p><p>-Es imposible. a... a... ah no lo puedo creer. Cómo entrarón? tiene que tener ayuda interna, es imposible. -<strong>Hui Ying</strong>.</p><p>-hahahaha, nada es imposible, ni impenetrable,  observa, ustedes lograron ingresar a un lugar que era imposible de entrar, sin embargo lo han hecho. Ahora viene lo más dificil, me intriga como van a sobrellevar esto. - <strong>Hombre Misterioso</strong>.</p><p>-Bueno, la inteligencia militar no es mi área, pero si debo admitir que me deja anonadada. Pero aunque pueda extraer la información, no podran replicar el experimento tal y como lo hemos hecho nosotros -<strong>Hui Ying</strong>.</p><p>-No estaría tan confiado, pero por ahora vamos a disfrutar el impresionante hallazgo. Se lo han ganado. No debemos dejar a nuestros invitados esperando - <strong>Hombre Misterioso</strong>.</p><p>Seis meses después del descubrimiento. Base <em>Manson</em> de Estados Unidos, en Washington,  era el lugar de lanzamiento del proyecto <strong>Benjamin</strong>. Una replica del proyecto <strong>Wunchang.</strong> La joya de investigación de DARPA y NASA y a su vez la esperanza de las fuerzas militares americanas para competir contra China. </p><p>Dos horas después. </p><p>¡MALDICIÓN!  No funciona. Solo logramos abrirlo por un minuto, no es suficiente, a este paso no lograremos alcanzar a China. Hace solo seis meses que China ha hecho sus investigaciones, quién sabe que nuevos descubrimientos a logrado  - Científico <strong>Owen Hayes</strong>.</p><p>-Pero Owen, Hemos hecho un gran avance,antes no podiamos abrir el portal, creo qué estás siendo muy injusto con el equipo - Científica <strong>Leah Brown Glancy</strong>.</p><p>-No lo entiendes, Mujer. Esto es una competencia. Es una Guerra de potencias, No podemos quedar atras. Hemos hecho todo lo posible, pero sigue sin funcionar, un minuto es muy poco tiempo para explorar el sitio, Esos Chinos deben estar burlandose de nosotros, dejame solo mejor. No quiero verlos partida de ineptos - <strong>Owen Hayes.</strong></p><p>Mientras tanto en otro lugar de la base Manson. </p><p>¡PUTA MIERDA! No hemos logrado nada, mis superiores no van a estar contentos. Esto no habria pasado si hace meses hubieramos conseguido la información que necesitabamos. Grita un hombre completamente enojado por las fallas del equipo. Ustedes tienen misiones simples y no han conseguido nada. De repente se ve interrumpido.</p><p>¡Knock!  ¡knock! suena la puerta. La abre una Persona que se encontraba en la habitación. Y llega un sujeto usando un traje formal completamente blanco, zapatos negros, con unos ojos azules como el cielo. </p><p>¿Quién eres? No debes estar aquí. Por favor vete, nos encontramos en una reunión importante - Científico <strong>Owen</strong>.</p><p>¡NO!  Quiero que todos ustedes abandone la habitación, Voy hablar con él -  dice el general <strong>Jackson</strong>.</p><p>-Pero señor - Científico <strong>Owen</strong>.</p><p>-Ya me oiste Owen, Quiero que se ¡LARGUEN!  ¡Ya! - general <strong>Jackson</strong></p><p>El científico Owen, no entiende por que el general Jackson, los hace salir de ese modo, sin ninguna explicación. Pero recuerda que puede ser un agente externo contratado para contrabandear y extraer información valiosa. Los verdaderos espías denominados scars no son empleados de ninguna agencia y trabajan en solitario, visten de blanco y zapatos negros, se encargan de infiltrarse y sacar toda la información a los servicios de inteligencia pero que, técnicamente, no se consideran trabajadores de los mismos.</p><p>Cuando todos abandonan la habitación. Pregunta al sujeto.</p><p>-Ya era hora que aparecieras, te hemos esperado por bastante tiempo ¿ Tienes lo que te pedimos ? - general <strong>Jackson</strong>.</p><p>-No, señor -dice el <strong>Scar</strong>.</p><p>-Y entonces ¿porque te apareces así ante nosotros? - general <strong>Jackson</strong>.</p><p>-Tengo otra información que te puede interesar. Nos informan que China perdio el control de su base, algo ha salido mal, se reporta un brote de una enfermedad nueva en <em>Wuhan</em>. La Organización Mundial de la Salud (OMS) está colaborando estrechamente con el gobierno y expertos mundiales para ampliar rápidamente los conocimientos científicos sobre este virus. Aún no han notificado al mundo de la amenaza. Parece que China está intentando controlarlo - <strong>Scar</strong>.</p><p>La mirada del general se torna fría y seria por un instante, se sentía extraño en la piel del general <strong>Jackson</strong>, cuando el cerebro le reaccionó.</p><p>-¿Qué información tienes sobre esté virus? - general <strong>Jackson.</strong></p><p>- Esté no es un virus, no es como cualquiera que hayamos visto antes. Es altamente contagioso, una persona puede contraer la enfermedad solo por contacto con otra persona que esté infectada. Se propaga a través de las gotículas que salen de la nariz o la boca de una persona al toser, estornudar o hablar. No llegan muy lejos estas gotículas pero si caen rápido al suelo y puede quedar sobre los objetos y superficies que rodean a la persona, además las personas pueden infectarse si tocan esos objetos o superficies. Cualquier persona que inhale las gotículas  procedentes de una persona o objeto infectada contraerá el virus.  Al parecer el jabón y el alcohol puede desinfectar los objetos. Yo de ustedes dejaría ese proyecto que estan haciendo, no les va traer nada bueno. - <strong>Scar</strong>.</p><p>-Algo más que quieras decirnos - general <strong>Jackson.</strong></p><p>-Sí hay más. Pero les costará mucho más - <strong>Scar</strong>.</p><p>-Me temo que no será posible, ahora no contamos con el presupuesto y menos ahora, después de nuestro fracaso - general <strong>Jackson.</strong></p><p>-Bien. Solo te puedo decir que es información muy importante, aunque tarde o temprano se darán cuenta de que se trata, ja,ja,ja no habra a dondé huir, creo que estamos condenados, bueno seguire con mis investigaciones. - <strong>Scar</strong>.</p><p>¡Espera! Y que hay de los Rusos - general <strong>Jackson.</strong></p><p>-Ellos se están preparando para lo que viene, no va ser fácil de enfrentar, les sugieron que hagan lo mismo - <strong>Scar</strong>.</p><p>¿Preparandose? ¿Para qué? </p><p>-No nos ha dicho mucho, y te hemos pagado bastante ¡Maldito Scar! - general <strong>Jackson.</strong></p><p>-Te he dicho lo suficiente. China no podrá contener el virus por mucho tiempo, Ellos ya tiene su chivo expiatorio pero de igual manera será el fin de la humanidad. Nunca debieron abrir ese portal, Yo de ustedes utilizariá esos recursos para hacer una fortaleza. Aunque sería mejor que se fueran del planeta  Ja,ja,ja. Cuando tenga más información, les avisaré. Pero eso sí necesito más dinero, No somos muy baratos por lo que ves  ja,ja,ja,ja - <strong>Scar</strong>.</p>","slug":"first-chapter","createdAt":"2020-08-27T17:26:38.000+00:00","id":"5f47ecce245d94001e629902","desc":"Chapter one\n\nAño 2019, un día antes del gran descubrimiento que cambió todo. \n\nLa noche era oscura y se encontraba lloviendo, habia bastante neblina para no\nvisualizar nada y afuera contrastaba con el aire frío.  Se encuentran dos\npersona hablando misteriosamente en una base secreta China.\n\n- ¿Está todo preparado? - preguntó un uniformado con rango de general.\n\n- Sí, señor.  El proyecto es sólido, los cientificos y técnicos nos confirma que\nesta vez funcionará, las pruebas así lo demuestran - re","tag":"history","image":null},{"title":"Scrapy","html":"<h2></h2><p>Scrapy, es un framework desarrollado en Python que permite rastrear un sitio web y extraer datos de manera eficiente.</p><p>Después de extraer la data de las páginas web, se pueden utilizar para un procesamiento más profundo y luego tomar desiciones importantes para el negocio, asi mismo esos datos se pueden almacenar en hojas de cálculo o cualquier otro programa. </p><p>Scrapy se estructura en cinco componentes principales:</p><h3 id=\"el-motor-de-scrapy\">El Motor de scrapy</h3><p>Este motor controla el flujo de datos de los demás componentes y es considerado el principal debido al poder que ofrece en la generación de peticiones y gestion de eventos contra una acción. </p><h3 id=\"planificador\">Planificador</h3><p>El componente de planificador recibe cada una de las solicitudes que envia el motor y las ograniza una por una en orden secuencial.</p><h3 id=\"descargador\">Descargador</h3><p>La finalidad del descargador es encontrar todas las páginas web y enviarlas al motor. Luego el motor enviará los sitios a las arañas.</p><h3 id=\"ara-as\">Arañas</h3><p>Las arañas son el código que se escribe para realizar el analisis y  extracción de los sitios web a buscar.</p><h3 id=\"tuber-a-de-elementos\">Tubería de elementos</h3><p>El último componente cumple la función de procesar cada uno de los elementos después de que las arañas extraen la información.</p><h2 id=\"instalaci-n-de-scrapy\">Instalación de Scrapy</h2><p>Para instalar scrapy en cualquier dispositivo es necesario contar con el lenguaje de programación Python. </p><p>Cuando se haya instalado Python, se podra instalar Scrapy con sus dependencias usando el administrador de paquetes de Python (pip) con el siguiente comando: <br></p><blockquote><em>pip install scrapy</em></blockquote><p></p><p>Para mayor información sobre la instalación y como instalar en los diferentes sistemas operativos  dirgirse al sitio oficial :  <a href=\"https://docs.scrapy.org/en/latest/intro/install.html\">Scrapy</a>.</p><p>Es recomendable instalar Scrapy en un entorno virtual debido a las dependencias del Framework pueden entrar en conflicto con otros paquetes del sistema Python lo cual podría ocasionar daños y afectar a otros scripts.</p>","slug":"scrapy","createdAt":"2020-08-27T17:14:21.000+00:00","id":"5f47e9ede15b67001e723377","desc":"\nScrapy, es un framework desarrollado en Python que permite rastrear un sitio web\ny extraer datos de manera eficiente.\n\nDespués de extraer la data de las páginas web, se pueden utilizar para un\nprocesamiento más profundo y luego tomar desiciones importantes para el negocio,\nasi mismo esos datos se pueden almacenar en hojas de cálculo o cualquier otro\nprograma. \n\nScrapy se estructura en cinco componentes principales:\n\nEl Motor de scrapy\nEste motor controla el flujo de datos de los demás component","tag":"tech","image":null}]