[{"title":"Usando Scrapy","html":"<p>Para comenzar a implementar Scrapy  se necesita  crear un entorno en python para realizar esta tarea se hace con la siguiente linea de comando:</p><blockquote>Python3 -m venv [nombre del entorno] </blockquote><p>NOTA: se debe tener instalado python en la version 3, podemos realizarlo con el manejado de paquetes brew en el caso de contar con un macbook o con el instalador de la página oficial para los demás equipos. Además se debe tener en cuenta que el nombre del entorno por buenas practicas se debe llamar<strong> [venv]  </strong>sin embargo no es una obligación.</p><p>Después se debe ingresar al entorno con el siguiente comando, algo a tener en cuenta es el sistema operativo con el que se cuenta. Para linux y mac se debe realizar con el siguiente:</p><blockquote>source venv/bin/activate</blockquote><p>Para salir del entorno en caso de ser necesario se realiza con el siguiente comando:</p><blockquote>deactivate</blockquote><p>Para continuar se debe instalar scrapy y autopep, igualmente se debe tener actualizado el pip de python para realizar esta tarea por lo cual dejare los dos comandos para realizar estas acciones:</p><blockquote>Python3 -m pip install pip —upgrade</blockquote><p>Despise de actualizar  procedemos a instalar las herramientas que necesitamos del framework:</p><blockquote>Pip install scrapy autopep8</blockquote><p>Una vez tengamos todo esto instalado pasaremos a crear un proyecto con scrapy, de la siguiente manera:</p><blockquote>Scrapy startproject [nombre del proyecto]</blockquote><p>Cuando se haya creado el proyecto podremos ingresar en el con el comando cd, para poder utilizar e implementar el framework se debe realizar todo en la carpeta <strong>Spider</strong>, donde se creará un archivo con el nombre que quiera con la extension .py<br><strong>Ejemplo  proyecto.py</strong></p><p>Para utilizar el framework  desde la consola se puede con el siguiente comando:</p><blockquote>Scrapy shell [ ’ url’ ]</blockquote><p><strong>Ejemplo:  scrapy shell 'https://www.cia.gov/library/readingroom/historical-collections'</strong></p>","slug":"usando-scrapy","createdAt":"2020-09-10T01:40:17.000+00:00","id":"5f59840177c34b001e52469d","desc":"Para comenzar a implementar Scrapy  se necesita  crear un entorno en python para\nrealizar esta tarea se hace con la siguiente linea de comando:\n\n> Python3 -m venv [nombre del entorno] \nNOTA: se debe tener instalado python en la version 3, podemos realizarlo con el\nmanejado de paquetes brew en el caso de contar con un macbook o con el\ninstalador de la página oficial para los demás equipos. Además se debe tener en\ncuenta que el nombre del entorno por buenas practicas se debe llamar [venv]sin\nembar","tag":"tech","image":null},{"title":"The last time","html":"<p><strong>Chapter one</strong></p><p>La noche era oscura y se encontraba lloviendo, habia bastante neblina para no visualizar nada y afuera contrastaba con el aire frío.  Se encuentran dos persona hablando misteriosamente en una base secreta China.</p><p>- ¿Está todo preparado? - preguntó un uniformado con rango de general.</p><p>- Sí, señor.  El proyecto es sólido, los cientificos y técnicos nos confirma que esta vez funcionará, las pruebas así lo demuestran - respondió el otro sujeto.</p><p>- Perfecto. Y que hay de los Rusos - preguntó el uniformado con rango de general.</p><p>- Todo indica que ellos también se encuentran haciendo experimentos, pero al parecer no ha funcionado, al igual que los Americanos. Señor, hay algo más, hemos encontrado evidencia que nos han estado espiando y tratando de conseguir nuestra tecnología. Hemos capturado a los responsables, son del grupo de espionaje  Cynthia  - respondió <strong>el otro sujeto</strong>.</p><p>-Bien, tienes mi permiso de ejecutarlos. Ahora tenemos que centrarnos en <strong>el proyecto</strong> <strong>Wunchang. </strong></p><p>El Gran día es mañana. China First - Exclamo <strong>el general</strong>.</p><p>Al día siguiente, todos verían el gran evento desde la amplia torre de control de la base. Altos militares, técnicos, cientificos, directivos de múltiples agencias y hasta el  Presidente de china estaban ahí. Una cientifica de nombre <strong><strong>Hui </strong>Y<strong>ing</strong> </strong>, revisaba complejos histogramas, grafos de comportamiento y análisis de patrones en los dispositivos, recién enviados desde la National Security Agency. Alguien a su lado lo interrumpió.</p><p>-Ya es hora de comenzar <strong>Hui Ying</strong>. Todos están impacientes. Esperemos que está vez funcione. - <strong>Li</strong></p><p>-Está bien, al parecer todo esta listo y funcionando. Y no tienes por que preocuparte, estoy segura que esta vez lo vamos a lograr.  <strong>Hui Ying</strong></p><p>-Espero que sí. Sabes lo que llegaría a pasar si no funciona. - <strong>Li</strong></p><p>-Calla, se muy bien todo lo que esta en juego pero estoy segura que está vez  va hacer nuestro gran momento. Enciendan las maquinas doctora <strong>Li</strong>.  - <strong>Hui Ying</strong></p><p></p>","slug":"first-chapter","createdAt":"2020-08-27T17:26:38.000+00:00","id":"5f47ecce245d94001e629902","desc":"Chapter one\n\nLa noche era oscura y se encontraba lloviendo, habia bastante neblina para no\nvisualizar nada y afuera contrastaba con el aire frío.  Se encuentran dos\npersona hablando misteriosamente en una base secreta China.\n\n- ¿Está todo preparado? - preguntó un uniformado con rango de general.\n\n- Sí, señor.  El proyecto es sólido, los cientificos y técnicos nos confirma que\nesta vez funcionará, las pruebas así lo demuestran - respondió el otro sujeto.\n\n- Perfecto. Y que hay de los Rusos - preg","tag":"history","image":null},{"title":"Scrapy","html":"<h2></h2><p>Scrapy, es un framework desarrollado en Python que permite rastrear un sitio web y extraer datos de manera eficiente.</p><p>Después de extraer la data de las páginas web, se pueden utilizar para un procesamiento más profundo y luego tomar desiciones importantes para el negocio, asi mismo esos datos se pueden almacenar en hojas de cálculo o cualquier otro programa. </p><p>Scrapy se estructura en cinco componentes principales:</p><h3 id=\"el-motor-de-scrapy\">El Motor de scrapy</h3><p>Este motor controla el flujo de datos de los demás componentes y es considerado el principal debido al poder que ofrece en la generación de peticiones y gestion de eventos contra una acción. </p><h3 id=\"planificador\">Planificador</h3><p>El componente de planificador recibe cada una de las solicitudes que envia el motor y las ograniza una por una en orden secuencial.</p><h3 id=\"descargador\">Descargador</h3><p>La finalidad del descargador es encontrar todas las páginas web y enviarlas al motor. Luego el motor enviará los sitios a las arañas.</p><h3 id=\"ara-as\">Arañas</h3><p>Las arañas son el código que se escribe para realizar el analisis y  extracción de los sitios web a buscar.</p><h3 id=\"tuber-a-de-elementos\">Tubería de elementos</h3><p>El último componente cumple la función de procesar cada uno de los elementos después de que las arañas extraen la información.</p><h2 id=\"instalaci-n-de-scrapy\">Instalación de Scrapy</h2><p>Para instalar scrapy en cualquier dispositivo es necesario contar con el lenguaje de programación Python. </p><p>Cuando se haya instalado Python, se podra instalar Scrapy con sus dependencias usando el administrador de paquetes de Python (pip) con el siguiente comando: <br></p><blockquote><em>pip install scrapy</em></blockquote><p></p><p>Para mayor información sobre la instalación y como instalar en los diferentes sistemas operativos  dirgirse al sitio oficial :  <a href=\"https://docs.scrapy.org/en/latest/intro/install.html\">Scrapy</a>.</p><p>Es recomendable instalar Scrapy en un entorno virtual debido a las dependencias del Framework pueden entrar en conflicto con otros paquetes del sistema Python lo cual podría ocasionar daños y afectar a otros scripts.</p>","slug":"scrapy","createdAt":"2020-08-27T17:14:21.000+00:00","id":"5f47e9ede15b67001e723377","desc":"\nScrapy, es un framework desarrollado en Python que permite rastrear un sitio web\ny extraer datos de manera eficiente.\n\nDespués de extraer la data de las páginas web, se pueden utilizar para un\nprocesamiento más profundo y luego tomar desiciones importantes para el negocio,\nasi mismo esos datos se pueden almacenar en hojas de cálculo o cualquier otro\nprograma. \n\nScrapy se estructura en cinco componentes principales:\n\nEl Motor de scrapy\nEste motor controla el flujo de datos de los demás component","tag":"tech","image":null}]